#ifndef __EFFECTID_H
#define __EFFECTID_H

typedef enum EFFECT_ID
{
		EF_WALK_DUST 			 =	0	, //	걷기 먼지
		EF_RUN_DUST				 =	1	, // 	달리기먼지
		EF_WALK_WAVE			 =	2	, // 	걷기 물파장
		EF_RUN_WAVE				 =	3	, // 	달리기 물파장
		//.......................................................................................................
		EF_LEVEL_UP				 =	4	, // 	레벨업 이펙트
		//.......................................................................................................
		EF_WARP_DISAPPEAR		 =	5	, // 	워프 이펙트 ( 사라질때 )
		EF_WARP_APPEAR			 =	6	, // 	워프 이펙트 ( 나타날때 )
		//.......................................................................................................
		EF_PLAYER_REVIVE		 =	7	, // 	플레이어 살아날때
		EF_PLAYER_DIE			 =	8	, // 	플레이어 죽기
		//.......................................................................................................
		EF_NPC_APPEAR		 	 =	9	, // 	NPC 생성
		EF_NPC_DIE			 	 =	10	, // 	NPC 죽기
		//.......................................................................................................
		EF_HAND_ATTACK			 =	11	, // 	손 기본 공격 ( 레인 밀레나 공통 )
		EF_HAND_ATTACKED0		 =	12	, // 	손 기본 공격 데미지 ( 약 )
		EF_HAND_ATTACKED1		 =	13	, // 	손 기본 공격 데미지 ( 중 )
		EF_HAND_ATTACKED2		 =	14	, // 	손 기본 공격 데미지 ( 강 )
		//.......................................................................................................
		EF_STAND_SWORD_ATTACK	 =	15	, // 	칼 기본 공격
		EF_STAND_SWORD_ATTACKED0 =	16	, // 	칼날 기본 데미지 ( 약 )
		EF_STAND_SWORD_ATTACKED1 =	17	, // 	칼날 기본 데미지 ( 중 )
		EF_STAND_SWORD_ATTACKED2 =	18	, // 	칼날 기본 데미지 ( 강 )
		//.......................................................................................................
		EF_STAND_BOOK_ATTACK	 =	19	, // 	마법기본공격(책)
		EF_STAND_BOOK_ATTACKED0	 =	20	, // 	마법기본공격(책) 데미지 ( 약 ) 
		EF_STAND_BOOK_ATTACKED1	 =	21	, // 	마법기본공격(책) 데미지 ( 중 ) 
		EF_STAND_BOOK_ATTACKED2	 =	22	, // 	마법기본공격(책) 데미지 ( 강 ) 
		//.......................................................................................................
		EF_STAND_STICK_ATTACK	 =	23	, // 	마법기본공격(지팡이)
		EF_STAND_STICK_ATTACKED0 =	24	, // 	마법기본공격(지팡이) 데미지 ( 약 ) 
		EF_STAND_STICK_ATTACKED1 =	25	, // 	마법기본공격(지팡이) 데미지 ( 중 ) 
		EF_STAND_STICK_ATTACKED2 =	26	, // 	마법기본공격(지팡이) 데미지 ( 강 ) 
		//.......................................................................................................
		EF_STAND_TOOTH_ATTACK	 =	27	, // 	이빨 기본 공격  
		EF_STAND_TOOTH_ATTACKED0 =	28	, // 	이빨 기본 공격   데미지 ( 약 ) 
		EF_STAND_TOOTH_ATTACKED1 =	29	, // 	이빨 기본 공격   데미지 ( 중 ) 
		EF_STAND_TOOTH_ATTACKED2 =	30	, // 	이빨 기본 공격   데미지 ( 강 ) 
		//.......................................................................................................
		EF_STAND_DULL_ATTACK	 =	31	, // 	둔기 기본 공격  
		EF_STAND_DULL_ATTACKED0	 =	32	, // 	둔기 기본 공격   데미지 ( 약 ) 
		EF_STAND_DULL_ATTACKED1	 =	33	, // 	둔기 기본 공격   데미지 ( 중 ) 
		EF_STAND_DULL_ATTACKED2	 =	34	, // 	둔기 기본 공격   데미지 ( 강 ) 
		//.......................................................................................................
		EF_STAND_NAIL_ATTACK	 =	35	, // 	발톱 기본 공격  
		EF_STAND_NAIL_ATTACKED0	 =	36	, //	발톱 기본 공격  데미지 ( 약 )
		EF_STAND_NAIL_ATTACKED1	 =	37	, //	발톱 기본 공격  데미지 ( 중 )
		EF_STAND_NAIL_ATTACKED2	 =	38	, //	발톱 기본 공격  데미지 ( 강 )
		//.......................................................................................................
		EF_ATTACK_MISS			 =	39	, //	공격시 실패했을경우 
		//.......................................................................................................
		EF_MILLENA_COMBO2		 = 40	, //	밀레나 콤보 2단계	O
		EF_MILLENA_COMBO3		 = 41	, //	밀레나 콤보 3단계	O
		EF_MILLENA_COMBO4		 = 42	, //	밀레나 콤보 4단계	O
		EF_MILLENA_COMBO5		 = 43	, //	밀레나 콤보 5단계	O
		EF_MILLENA_COMBOEX		 = 44	, //	밀레나 콤보 Ex단계	O
		//.......................................................................................................
		EF_RAIN_COMBO2			 = 45	, //	레인 콤보 2단계	O
		EF_RAIN_COMBO3			 = 46	, //	레인 콤보 3단계	O
		EF_RAIN_COMBO4			 = 47	, //	레인 콤보 4단계	O
		EF_RAIN_COMBO5			 = 48	, //	레인 콤보 5단계	O
		EF_RAIN_COMBOEX			 = 49	, //	레인 콤보 Ex단계	O
		//.......................................................................................................
		EF_LIGHTNING0			 = 50	, //	라이트닝 0단계	X
		EF_LIGHTNING1			 = 51	, //	라이트닝 1단계	X
		EF_LIGHTNING2			 = 52	, //	라이트닝 2단계	X
		EF_LIGHTNING3			 = 53	, //	라이트닝 3단계	X
		EF_LIGHTNING4			 = 54	, //	라이트닝 4단계	X
		//.......................................................................................................
		EF_LIGHTNING_ATTACKED0	 = 55	, //	라이트닝 데미지 0	O
		EF_LIGHTNING_ATTACKED1	 = 56	, //	라이트닝 데미지 1	O
		EF_LIGHTNING_ATTACKED2	 = 57	, //	라이트닝 데미지 2	O
		EF_LIGHTNING_ATTACKED3	 = 58	, //	라이트닝 데미지 3	O
		EF_LIGHTNING_ATTACKED4	 = 59	, //	라이트닝 데미지 4	O
		//.......................................................................................................
		EF_FIREBALL0			 = 60	, //	화이어볼0	X
		EF_FIREBALL1			 = 61	, //	화이어볼1	X
		EF_FIREBALL2			 = 62	, //	화이어볼2	X
		EF_FIREBALL3			 = 63	, //	화이어볼3	X
		EF_FIREBALL4			 = 64	, //	화이어볼4	X
		//.......................................................................................................
		EF_FIREBALL_ATTACKED0	 = 65	, //	화이어볼 데미지0	O
		EF_FIREBALL_ATTACKED1	 = 66	, //	화이어볼 데미지1	O
		EF_FIREBALL_ATTACKED2	 = 67	, //	화이어볼 데미지2	O
		EF_FIREBALL_ATTACKED3	 = 68	, //	화이어볼 데미지3	O
		EF_FIREBALL_ATTACKED4	 = 69	, //	화이어볼 데미지4	O
		//.......................................................................................................
		EF_ROCKPRESS0			 = 70	, //	락 프레스
		EF_ROCKPRESS1			 = 71	,	
		EF_ROCKPRESS2			 = 72	,			
		EF_ROCKPRESS3	         = 73	,	
		EF_ROCKPRESS4	         = 74	,	
		//.......................................................................................................
		EF_ROCKPRESS_ATTACKED0	 = 75	, // 락 프레스 데미지
		EF_ROCKPRESS_ATTACKED1	 = 76	,	
		EF_ROCKPRESS_ATTACKED2	 = 77	,	
		EF_ROCKPRESS_ATTACKED3	 = 78	,	
		EF_ROCKPRESS_ATTACKED4	 = 79	,	
		//.......................................................................................................
		EF_WOODENSWORD0	         = 80	, // 우든 소드
		EF_WOODENSWORD1	         = 81	,	
		EF_WOODENSWORD2	         = 82	,	
		EF_WOODENSWORD3	         = 83	,	
		EF_WOODENSWORD4	         = 84	,	
		//.......................................................................................................
		EF_WOODENSWORD_ATTACKED0 = 85	, // 우든 소드 데미지
		EF_WOODENSWORD_ATTACKED1 = 86	,	
		EF_WOODENSWORD_ATTACKED2 = 87	,	
		EF_WOODENSWORD_ATTACKED3 = 88	,	
		EF_WOODENSWORD_ATTACKED4 = 89	,	
		//.......................................................................................................
		EF_ICESPIRE0	         = 90	, // 아이스 스피어
		EF_ICESPIRE1	         = 91	,	
		EF_ICESPIRE2	         = 92	,	
		EF_ICESPIRE3	         = 93	,	
		EF_ICESPIRE4	         = 94	,	
		//.......................................................................................................
		EF_ICESPIRE_ATTACKED0	 = 95	, //아이스 스피어 데미지
		EF_ICESPIRE_ATTACKED1	 = 96	,	
		EF_ICESPIRE_ATTACKED2	 = 97	,	
		EF_ICESPIRE_ATTACKED3	 = 98	,	
		EF_ICESPIRE_ATTACKED4	 = 99 	,
		//.......................................................................................................
		EF_V_CUT_ATTACK0		 = 100	, // 노려베기
		EF_V_CUT_ATTACK1		 = 101	,
		EF_V_CUT_ATTACK2		 = 102	,
		EF_V_CUT_ATTACK3		 = 103	,
		EF_V_CUT_ATTACK4		 = 104 	,
		//.......................................................................................................
		EF_V_CUT_ATTACKED		 = 105	, // 노려 베기 데미지
		//.......................................................................................................
		EF_GATHER_CUT0		     = 106	, // 모아 베기
		EF_GATHER_CUT1		     = 107	,
		EF_GATHER_CUT2			 = 108	,
		EF_GATHER_CUT3			 = 109 	,
		EF_GATHER_CUT4			 = 110	,
		//.......................................................................................................
		EF_GATHER_CUT_ATTACKED	 = 111	, // 모아 베기 데미지
		//.......................................................................................................
		//.......................................................................................................
		EF_REFRESH_SWORD0		 = 117	, // 쾌검 ( 지속 스킬 )
		EF_REFRESH_SWORD1		 = 118	,
		EF_REFRESH_SWORD2		 = 119 	,
		EF_REFRESH_SWORD3		 = 120	,
		EF_REFRESH_SWORD4		 = 121	,
		//.......................................................................................................
		EF_STRONG_SWORD0		 = 122	, // 강검 ( 지속 스킬 )
		EF_STRONG_SWORD1		 = 123	,
		EF_STRONG_SWORD2		 = 124 	,
		EF_STRONG_SWORD3		 = 125	,
		EF_STRONG_SWORD4		 = 126	,
		//.......................................................................................................
		EF_ROCK_SHIELD0			 = 132	, // 락 실드
		EF_ROCK_SHIELD1			 = 133	,
		EF_ROCK_SHIELD2			 = 134 	,
		EF_ROCK_SHIELD3			 = 135	,
		EF_ROCK_SHIELD4			 = 136	,
		//.......................................................................................................
		EF_ICE_SHIELD0			 = 137	, // 아이스 실드 
		EF_ICE_SHIELD1			 = 138	,
		EF_ICE_SHIELD2			 = 139 	,
		EF_ICE_SHIELD3			 = 140	,
		EF_ICE_SHIELD4			 = 141	,
		//.......................................................................................................
		EF_RECOVERY_ITEM1_0		 = 166	, // 회복 아이템 1 ( 즉효성 )
		EF_RECOVERY_ITEM1_1		 = 167	,
		EF_RECOVERY_ITEM1_2		 = 168 	,
		EF_RECOVERY_ITEM1_3		 = 169	,
		EF_RECOVERY_ITEM1_4	     = 170	,
		//.......................................................................................................
		EF_RECOVERY_ITEM2_0	     = 146	, // 회복 아이템 2 ( 지속성 )
		EF_RECOVERY_ITEM2_1	     = 147	,
		EF_RECOVERY_ITEM2_2	     = 148 	,
		EF_RECOVERY_ITEM2_3	     = 149	,
		EF_RECOVERY_ITEM2_4	     = 150	,
		//.......................................................................................................
		EF_CAP_SWORD_ATTACK0	 = 160	, // 급소베기
		EF_CAP_SWORD_ATTACK1	 = 161	,
		EF_CAP_SWORD_ATTACK2	 = 162	,
		EF_CAP_SWORD_ATTACK3	 = 163	,
		EF_CAP_SWORD_ATTACK4	 = 164	,
		//.......................................................................................................
		EF_CAP_SWORD_ATTTACKED	 = 165	, // 급소베기 데미지
		//.......................................................................................................
		EF_BUBBLE_CRASH0			 = 171	, // 버블 크래쉬 ( 3단계 )
		EF_BUBBLE_CRASH1			 = 172	,
		EF_BUBBLE_CRASH2			 = 173	,
		EF_BUBBLE_CRASH3			 = 174	,
		EF_BUBBLE_CRASH4			 = 175	,
		//.......................................................................................................
		EF_BUBBLE_CRASH_ATTACKED0	 = 176  ,	// 버블 크래쉬 데미지 ( 3 단계 )
		EF_BUBBLE_CRASH_ATTACKED1	 = 177  ,
		EF_BUBBLE_CRASH_ATTACKED2	 = 178  ,
		EF_BUBBLE_CRASH_ATTACKED3	 = 179  ,
		EF_BUBBLE_CRASH_ATTACKED4	 = 180  ,
		//.......................................................................................................
		EF_WEAPON_CRASH0			 = 181 ,	// 무장해제 ( 맞는 사람꺼 )
		EF_WEAPON_CRASH1			 = 182 ,	
		EF_WEAPON_CRASH2			 = 183 ,	
		EF_WEAPON_CRASH3			 = 184 ,	
		EF_WEAPON_CRASH4			 = 185 ,	
		//.......................................................................................................
		EF_AVOID0	= 186			       ,	// 회피(스킬거는 사람)
		EF_AVOID1	= 187				   ,	
		EF_AVOID2	= 188				   ,	
		EF_AVOID3	= 189				   ,	
		EF_AVOID4	= 190                  ,	
		//.......................................................................................................
		EF_CORE0	= 191				   ,    // 코어
		EF_PICK		= 192				   ,    // 픽킹시 이펙트		
		EF_PICK_X   = 193				   ,	// 픽킹시 못가는곳 클릭시
		EF_RAIN_GATHER = 194			   ,    // 레인 기 모으기
		//.......................................................................................................
		EF_RAIN_BOOK_SPOT_SPELL0	= 195 ,		// 레인 영창 단계 오라
		EF_RAIN_BOOK_SPOT_SPELL1	= 196 ,
		EF_RAIN_BOOK_SPOT_SPELL2	= 197 ,
		EF_RAIN_BOOK_SPOT_SPELL3	= 198 ,
		EF_RAIN_BOOK_SPOT_SPELL4	= 199 , 
		//.......................................................................................................
		EF_RAIN_BOOK_LINK_SPELL0	= 200 ,		// 레인 영창 단계 손에 링크
		EF_RAIN_BOOK_LINK_SPELL1	= 201 ,
		EF_RAIN_BOOK_LINK_SPELL2	= 202 ,
		EF_RAIN_BOOK_LINK_SPELL3	= 203 , 
		EF_RAIN_BOOK_LINK_SPELL4	= 204 ,
		EF_RAIN_BOOK_LINK_SPELL5	= 205 ,
		//.......................................................................................................
		EF_QUEST_MARK				= 206 ,		// 퀘스트 마크
		//.......................................................................................................
		EF_ITEM_DROP				= 207 ,		// 몹이 아이템 버리고 죽을때
		//.......................................................................................................
		EF_RAIN_GATHER2				= 208 ,		// 왼손
		EF_RAIN_GATHER3				= 209 ,		// 오른손
		//.......................................................................................................
		EF_MILLENA_COMBO_SPOT0		= 210 ,     // 콤보 성공시 몸에서 터지는 거
		EF_MILLENA_COMBO_SPOT1		= 211 ,     // 콤보 성공시 몸에서 터지는 거
		EF_MILLENA_COMBO_SPOT2		= 212 ,     // 콤보 성공시 몸에서 터지는 거
		EF_MILLENA_COMBO_SPOT3		= 213 ,     // 콤보 성공시 몸에서 터지는 거
		EF_MILLENA_COMBO_SPOT4		= 214 ,     // 콤보 성공시 몸에서 터지는 거
		//.......................................................................................................
		EF_CHARACTER_SELECT			= 215 ,     // 캐릭터 선택시 이펙트
		//.......................................................................................................
		EF_REST_BREATH				= 216 ,     // 명상시 ( 밀레나 )
		EF_REST_RAIN				= 217 ,     // 명상시 ( 레인   )
		//.......................................................................................................
		// 레인 영창시 이펙트
		//.......................................................................................................
		EF_FIREBALL_SPOT_SPELL0  	= 218 ,
		EF_FIREBALL_SPOT_SPELL1  	= 219 ,
		EF_FIREBALL_SPOT_SPELL2  	= 220 ,
		EF_FIREBALL_SPOT_SPELL3  	= 221 ,
		EF_FIREBALL_SPOT_SPELL4  	= 222 ,
		EF_FIREBALL_SPOT_SPELL5  	= 223 ,
		EF_FIREBALL_LINK_SPELL0  	= 224 ,
		EF_FIREBALL_LINK_SPELL1  	= 225 ,
		EF_FIREBALL_LINK_SPELL2  	= 226 ,
		EF_FIREBALL_LINK_SPELL3  	= 227 ,
		EF_FIREBALL_LINK_SPELL4  	= 228 ,
		EF_FIREBALL_LINK_SPELL5  	= 229 ,
		EF_ICESPIRE_SPOT_SPELL0  	= 230 ,
		EF_ICESPIRE_SPOT_SPELL1  	= 231 ,
		EF_ICESPIRE_SPOT_SPELL2  	= 232 ,
		EF_ICESPIRE_SPOT_SPELL3  	= 233 ,
		EF_ICESPIRE_SPOT_SPELL4  	= 234 ,
		EF_ICESPIRE_SPOT_SPELL5  	= 235 ,
		EF_ICESPIRE_LINK_SPELL0  	= 236 ,
		EF_ICESPIRE_LINK_SPELL1  	= 237 ,
		EF_ICESPIRE_LINK_SPELL2  	= 238 ,
		EF_ICESPIRE_LINK_SPELL3  	= 239 ,
		EF_ICESPIRE_LINK_SPELL4  	= 240 ,
		EF_ICESPIRE_LINK_SPELL5  	= 241 ,
		EF_BUBBLE_SPOT_SPELL0  	= 242 ,
		EF_BUBBLE_SPOT_SPELL1  	= 243 ,
		EF_BUBBLE_SPOT_SPELL2  	= 244 ,
		EF_BUBBLE_SPOT_SPELL3  	= 245 ,
		EF_BUBBLE_SPOT_SPELL4  	= 246 ,
		EF_BUBBLE_SPOT_SPELL5  	= 247 ,
		EF_BUBBLE_LINK_SPELL0  	= 248 ,
		EF_BUBBLE_LINK_SPELL1  	= 249 ,
		EF_BUBBLE_LINK_SPELL2  	= 250 ,
		EF_BUBBLE_LINK_SPELL3  	= 251 ,
		EF_BUBBLE_LINK_SPELL4  	= 252 ,
		EF_BUBBLE_LINK_SPELL5  	= 253 ,
		EF_WOODEN_SPOT_SPELL0  	= 254 ,
		EF_WOODEN_SPOT_SPELL1  	= 	255 ,
		EF_WOODEN_SPOT_SPELL2  	= 	256 ,
		EF_WOODEN_SPOT_SPELL3  	= 	257 ,
		EF_WOODEN_SPOT_SPELL4  	= 	258 ,
		EF_WOODEN_SPOT_SPELL5  	= 	259 ,
		EF_WOODEN_LINK_SPELL0  	= 	260 ,
		EF_WOODEN_LINK_SPELL1  	= 	261 ,
		EF_WOODEN_LINK_SPELL2  	= 	262 ,
		EF_WOODEN_LINK_SPELL3  	= 	263 ,
		EF_WOODEN_LINK_SPELL4  	= 	264 ,
		EF_WOODEN_LINK_SPELL5  	= 	265 ,
		EF_ROCK_SPOT_SPELL0  	= 	266 ,
		EF_ROCK_SPOT_SPELL1  	= 	267 ,
		EF_ROCK_SPOT_SPELL2  	= 	268 ,
		EF_ROCK_SPOT_SPELL3  	= 	269 ,
		EF_ROCK_SPOT_SPELL4  	= 	270 ,
		EF_ROCK_SPOT_SPELL5  	= 	271 ,
		EF_ROCK_LINK_SPELL0  	= 	272 ,
		EF_ROCK_LINK_SPELL1  	= 	273 ,
		EF_ROCK_LINK_SPELL2  	= 	274 ,
		EF_ROCK_LINK_SPELL3  	= 	275 ,
		EF_ROCK_LINK_SPELL4  	= 	276 ,
		EF_ROCK_LINK_SPELL5  	= 	277 ,
		EF_LIGHTNING_SPOT_SPELL0  	= 	278 ,
		EF_LIGHTNING_SPOT_SPELL1  	= 	279 ,
		EF_LIGHTNING_SPOT_SPELL2  	= 	280 ,
		EF_LIGHTNING_SPOT_SPELL3  	= 	281 ,
		EF_LIGHTNING_SPOT_SPELL4  	= 	282 ,
		EF_LIGHTNING_SPOT_SPELL5  	= 	283 ,
		EF_LIGHTNING_LINK_SPELL0  	= 	284 ,
		EF_LIGHTNING_LINK_SPELL1  	= 	285 ,
		EF_LIGHTNING_LINK_SPELL2  	= 	286 ,
		EF_LIGHTNING_LINK_SPELL3  	= 	287 ,
		EF_LIGHTNING_LINK_SPELL4  	= 	288 ,
		EF_LIGHTNING_LINK_SPELL5  	= 	289 ,
		//.......................................................................................................
		EF_BOW_ATTACK0				=   290	,				// 아처 기본 활 공격
		EF_ARROW_STUCK			    =   291	,				// 화살 꽂히는거
		EF_BOW_ATTACKED_0			=	292	,				// 아처 기본 활공격 데미지 (약)
		EF_BOW_ATTACKED_1			=	293 ,				// 아처 기본 활공격 데미지 (중)
		EF_BOW_ATTACKED_2			=   294 ,				// 아처 기본 활공격 데미지 (강)
		EF_BOW_SPOT					=   295 ,				// 화살 나갈때 쏘는사람에게 씌우는 이펙트요
		//.......................................................................................................
		EF_GLAER_BOW_0				=   296	,				// 노려쏘기
		EF_GLAER_BOW_1				=   297	,
		EF_GLAER_BOW_2				=   298	,
		EF_GLAER_BOW_ATTACKED_0	    =   299	,               // 노려쏘기 ( 데미지 )
		EF_GLAER_BOW_ATTACKED_1	    =   300	,
		EF_GLAER_BOW_ATTACKED_2	    =   301	,
		//.......................................................................................................
		EF_FOOT_BOW_0				=   302	,				// 발등쏘기
		EF_FOOT_BOW_1				=   303	,
		EF_FOOT_BOW_2				=   304	,
		EF_FOOT_BOW_ATTACKED_0		=   305	,				// 발등쏘기 ( 데미지 : 지속 )
		EF_FOOT_BOW_ATTACKED_1		=	306	,
		EF_FOOT_BOW_ATTACKED_2		=	307	,
		EF_FOOT_BOW_LINK			=	308	,				// 발등쏘기 ( 화살 처리 )
		//.......................................................................................................
		EF_REFRESH_BOW_0			=   309	,				// 치유의 화살
		EF_REFRESH_BOW_1			=   310	,
		EF_REFRESH_BOW_2			=   311	,
		EF_REFRESH_BOW_ATTACKED_0	=	312	,				// 치유의 화살 ( 데미지 )
		EF_REFRESH_BOW_ATTACKED_1	=	313	,
		EF_REFRESH_BOW_ATTACKED_2	=   314	,
		//.......................................................................................................
		EF_QUICK_BOW_0				=   315	,				// 속사(지속성)
		EF_QUICK_BOW_1				=   316 ,	
		EF_QUICK_BOW_2				=   317	,
		//.......................................................................................................
		EF_FOCUS_BOW_0				=   318	,				// 집중(지속성)
		EF_FOCUS_BOW_1				=	319 ,			
		EF_FOCUS_BOW_2				=	320	,
		//.......................................................................................................
		EF_POSSESSED_0				=	321	,				// 빙의 (지속성,종류별로)
		EF_POSSESSED_1				=	322	,
		EF_POSSESSED_2				=	323	,
		EF_POSSESSED_3				=	324	,
		EF_POSSESSED_4				=	325	,
		EF_POSSESSED_CANCEL			=	326	,				// 빙의 해제
		//.......................................................................................................
		EF_FIRE_SMACK_0				=	327	,				// 화염연타
		EF_FIRE_SMACK_1				=	328	,
		EF_FIRE_SMACK_2				=	329	,
		EF_FIRE_SMACK_ATTACKED_0	=	330	,				// 화염연타(데미지)
		EF_FIRE_SMACK_ATTACKED_1	=	331	,	
		EF_FIRE_SMACK_ATTACKED_2	=	332	,
		//.......................................................................................................
		EF_FOOT_LIGHTNING_0			=	333	,				// 벽뢰각
		EF_FOOT_LIGHTNING_1			=	334	,
		EF_FOOT_LIGHTNING_2			=	335	,
		EF_FOOT_LIGHTNING_ATTACKED_0 =	336	,				// 벽뢰각(데미지)
		EF_FOOT_LIGHTNING_ATTACKED_1 =	337	,
		EF_FOOT_LIGHTNING_ATTACKED_2 =	338	,
		//.......................................................................................................
		EF_ABSOLUTE_DP_0			=	339	,				// 절대방어
		EF_ABSOLUTE_DP_1			=	340	,
		EF_ABSOLUTE_DP_2			=	341	,
		//.......................................................................................................
		EF_FOOT_STRENGTH_0			=	342	,				// 마인에 각력(지속성)
		EF_FOOT_STRENGTH_1			=	343	,
		EF_FOOT_STRENGTH_2			=	344	,
		//.......................................................................................................
		EF_BOUND_ATTACK				=   345	,				// 받아치기
		//.......................................................................................................
		EF_FIRE_ARMOR0				=	346	,				//	파이어아머 ( 프로그램 처리 )
		EF_FIRE_ARMOR1				=	347 ,	
		EF_FIRE_ARMOR2				=	348	,
		//.......................................................................................................
		EF_ICE_SHILED0				=	349	,				//	아이스필드( 프로그램처리)
		EF_ICE_SHILED1				=	350	,
		EF_ICE_SHILED2				=	351	,
		//.......................................................................................................
		EF_APPEAR_BING0				=	352	,				//	빙신 출현 ( 지속 )
		EF_APPEAR_BING1				=	353	,
		EF_APPEAR_BING2				=	354	,
		EF_APPEAR_BING3				=	355	,
		EF_APPEAR_BING4				=	356	,
		//.......................................................................................................
		EF_BALL_ATTACK				=   357	,				// 수정구 공격
		EF_BALL_ATTACKED0			=	358	,				// 수정구 공격 데미지
		EF_BALL_ATTACKED1			=	359	,
		EF_BALL_ATTACKED2			=	360	,
		//.......................................................................................................
		EF_BOUND_ATTACK_PROC		=	361	,				// 받아쳤을때
		//.......................................................................................................
		EF_QUEST_MARK2				=   362 ,				// 퀘스마크2
		//.......................................................................................................
		// 3 차 이펙트
		//.......................................................................................................
		EF_NIGHT_STAND_ATTACK	    =	363	,				// 나이트 기본 공격
		EF_NIGHT_STAND_ATTACKED0	=	364	,				// 나이트 기본 데미지
		EF_NIGHT_STAND_ATTACKED1	=	365 ,				
		EF_NIGHT_STAND_ATTACKED2	=	366	,
		//.......................................................................................................
		EF_SHILED_ATTACK0			=   367	,				// 방패 가격
		EF_SHILED_ATTACK1			=	368	,				
		EF_SHILED_ATTACK2			=	369	,
		EF_SHILED_ATTACEKD0			=	370	,				// 방패 가격 데미지
		EF_SHILED_ATTACEKD1			=	371	,		
		EF_SHILED_ATTACEKD2			=	372	,
		//.......................................................................................................
		EF_FOOT_QUAKE0				=	373	,				// 발구르기
		EF_FOOT_QUAKE1				=	374	,				
		EF_FOOT_QUAKE2				=	375	,
		EF_FOOT_QUAKE_ATTACKED0		=	376	,				// 발구르기 데미지
		EF_FOOT_QUAKE_ATTACKED1		=	377	,
		EF_FOOT_QUAKE_ATTACKED2		=	378	,
		//.......................................................................................................
		EF_ATTACKED_FOCUS			=	379	,				// 도발
		EF_ATTACK_FOCUS				=	380	,				// 도발 데미지
		//.......................................................................................................
		EF_PRESSURE_AURA			=   381	,				// 중압감
		//.......................................................................................................
		EF_DEFEND_SETUP				=	382	,				// 방어태세
		//.......................................................................................................
		EF_SLAYER_STAND_ATTACK		=	383	,				//	슬래이어 기본 공격
		EF_SLAYER_STAND_ATTACKED0	=	384	,				//  슬레이어 기본 공격 데미지
		EF_SLAYER_STAND_ATTACKED1	=	385	,				
		EF_SLAYER_STAND_ATTACKED2	=	386	,
		//.......................................................................................................
		EF_CIRCLE_SWORD				=	387	,				//	대원참 ( 데미지는 칼 데미지 )
		//.......................................................................................................
		EF_BLOOD_RUNAWAY			=	388	,				// 피의 폭주
		//.......................................................................................................
		EF_LIVE_MIND				=	389	,				// 불굴의 의지
		//.......................................................................................................
		EF_PRIEST_STAND_ATTACK		=	390	,				// 프리스트 기본공격 ( 지팡이 )
		EF_PRIEST_STAND_ATTACKED0	=	391	,				// 프리스트 기본공격 데미지
		EF_PRIEST_STAND_ATTACKED1	=	392	,
		EF_PRIEST_STAND_ATTACKED2	=	393	,
		//.......................................................................................................
		EF_HEAL0					=	394	,				// 힐링
		EF_HEAL1					=	395	,		
		EF_HEAL2					=	396	,
		EF_HEALED0					=	397	,				// 힐링 대상
		EF_HEALED1					=	398	,
		EF_HEALED2					=	399	,
		//.......................................................................................................
		EF_PARTY_HEAL				=	400	,				// 파티 힐링
		EF_PARTY_HEALED				=	401	,				// 파티 힐링 대상
		//.......................................................................................................
		EF_DISPELL					=	402	,				// 디스펠
		EF_DISPELLED				=	403	,				// 디스펠 대상
		//.......................................................................................................
		EF_WARM_LIGHT				=	404	,				// 따뜻한 빛
		EF_WARM_LIGHTED				=   405	,				// 따뜻한 빛 대상
		//.......................................................................................................
		EF_LUCKY_GOD				=	406	,				// 행운의 여신
		EF_LUCKY_GODED				=	407	,				// 행운의 여신 대상
		//.......................................................................................................
		EF_NPC_WOOD_ATTACK			=	408	,				// 머록스 나무정령 기본공격
		EF_NPC_WOOD_ATTACKED0		=	409	,				// 머록스 나무정령 기본공격 데미지
		EF_NPC_WOOD_ATTACKED1		=	410	,
		EF_NPC_WOOD_ATTACKED2		=	411	,
		//.......................................................................................................
		EF_NPC_FIRE					=	412	,				// 블러켄 화염		  ( 기본 공격 )
		EF_NPC_FIREED0				=	413	,				// 블러켄 화염 데미지 ( 기본 공격 )
		EF_NPC_FIREED1				=	414	,
		EF_NPC_FIREED2				=	415	,
		//.......................................................................................................
		EF_NPC_STICK				=	416	,				// 파이몬 지팡이(파티클다른거)
		EF_NPC_STICK_ATTACKED0		=	417	,				// 파이몬 지팡이 데미지
		EF_NPC_STICK_ATTACKED1		=	418	,
		EF_NPC_STICK_ATTACKED2		=	419	,
		//.......................................................................................................
		EF_NPC_HEAVY_STICK			=	420	,				// 파이온 우두머리 ( 타우린 )
		EF_NPC_HEAVY_STICKED0		=	421	,				// 파이몬 때리기
		EF_NPC_HEAVY_STICKED1		=	422	,			
		EF_NPC_HEAVY_STICKED2		=	423	,
		//.......................................................................................................
		EF_REVIVAL					=	424	,				// 부활
		//.......................................................................................................
		EF_SWORD_FLASH0				=	425	,				// 검진
		EF_SWORD_FLASH1				=	426	,			
		EF_SWORD_FLASH2				=	427	,
		EF_SWORD_FLASHED0			=	428 ,				// 검진 데미지
		EF_SWORD_FLASHED1			=	429	,
		EF_SWORD_FLASHED2			=	430	,
		//.......................................................................................................
		EF_NPC_QUAKE_HEAVY_STICKED0		=	431	,			// 파이몬 바닥찍기 ( 데미지 )
		EF_NPC_QUAKE_HEAVY_STICKED1		=	432 ,	
		EF_NPC_QUAKE_HEAVY_STICKED2		=	433	,
		//.......................................................................................................
		EF_NPC_FIRE_SKILL				=	434 ,			// NPC 파이어볼 스킬
		//.......................................................................................................
		EF_NPC_QUAKE_HEAVY_STICK		=	435	,			// 파이온 우두머리 ( 타우린 바닥찍기)
		//.......................................................................................................
		EF_CIRCLE_SWORDED				=	436	,			// 대원참 데미지
		//.......................................................................................................
		EF_PRESSURE_AURA1				=   437	,			// 중압감(지속)
		EF_PRESSURE_AURAED			    =   438	,			// 중압감데미지(지속)
		EF_WARM_LIGHT1					=   439	,			// 따뜻한 빛(지속)
		//.......................................................................................................
		EF_BUBBLE_ATTACK				=   440 ,			// NPC 물방울 공격
		EF_BUBBLE_ATTACKED				=   441 ,			// NPC 물방울 공격 데미지
		//.......................................................................................................
		EF_AXE_LAND_HIT					=	442 ,			// NPC 도끼로 바닥찍기
		EF_AXE_LAND_HITED				=	443	,			// NPC 도끼로 바닥찍기 데미지
		//.......................................................................................................
		EF_FRUIT_ATTACK					=   444 ,			// NPC 과일 던지기
		EF_FRUIT_ATTACKED				=   445	,			// NPC 과일 던지기 데미지
		//.......................................................................................................
		EF_MOUTH_FIRE					=	446 ,			// NPC 입에서 불덩어리 쏘기
		EF_MOUTH_FIREED					=	447 ,			// NPC 입에서 불덩어리 쏘기 데미지
		//.......................................................................................................
		EF_MOUTH_FIRE1					=	448 ,			// NPC 입에서 불덩어리 쏘기 1
		EF_MOUTH_FIREED1				=	449 ,			// NPC 입에서 불덩어리 쏘기 데미지 1
		//.......................................................................................................
		EF_ROCK_SHOT					=	450 ,			// NPC 돌 던지기 
		EF_ROCK_SHOTED					=	451 ,			// NPC 돌 던지기 데미지
		//.......................................................................................................
		EF_ROCK_SHOT1					=	452 ,			// NPC 돌 던지기  
		EF_ROCK_SHOTED1					=	453 ,			// NPC 돌 던지기 데미지
		//.......................................................................................................
		EF_GAS_SHOT						=	454 ,			// NPC 가스 
		EF_GAS_SHOTED					=	455 ,			// NPC 가스 데미지
		//.......................................................................................................
		EF_GAGE_TRANS					=   456 ,			// 게이지 전송
		EF_GAGE_TRANSED					=   457 ,			// 게이지 전송 받음
		EF_PLUS_GAGE					=   458 ,           // 게이지 전송 +1 Gage
		EF_SUB_GAGE						=   459 ,			// 게이지 전송 -1 Gage
		//.......................................................................................................
		EF_LOG_EFFECT0					=   460 ,			// 로그인 이펙트
		//.......................................................................................................
		// 부가 효과 (부가효과가 걸리면 EF_ADDEFFECT_BASE 에서일괄처리해준다)
		//.......................................................................................................
		EF_ADDEFFECT_BASE				=   461	,			// 부가효과 베이스
		EF_MOVE_OBSTRUCTION				=	462	,			// 이동장애
		EF_FAINT						=	463	,			// 마비 or 기절
		EF_SLEEP						=	464	,			// 수면
		EF_POISONING					=	465	,			// 중독
		EF_PROVOCATION					=	466	,			// 도발
		EF_COMBO_OBSTRUCTION			=	467	,			// 콤보장애
		EF_FREEZING						=	468	,			// 빙결
		EF_STONY						=	469	,			// 석화
		EF_WHISPER						=   527 ,			// 침묵
		//.......................................................................................................
		EF_EGNEETION0					=	470	,			// 이그니션 공격 약
		EF_EGNEETION1					=	471	,			// 이그니션 공격 중
		EF_EGNEETION2					=	472	,			// 이그니션 공격 강
		EF_EGNEETION_ED0				=	473	,			// 이그니션 공격 데미지 약
		EF_EGNEETION_ED1				=	474	,			// 이그니션 공격 데미지 중
		EF_EGNEETION_ED2				=	475	,			// 이그니션 공격 데미지 강
		EF_EGNEETION_LINK				=	476	,			// 이그니션 영창 ( 양손 )
		//.......................................................................................................
		EF_CHARGE						=	477	,			// 챠지 ( 자기한테 거는것 - 지속성 )
		//.......................................................................................................
		EF_CR_TOUCH0					=	478	,			// 칠링터치 약중강
		EF_CR_TOUCH1					=	479	,
		EF_CR_TOUCH2					=	480	,
		EF_CR_TOUCH_ED0					=	481	,			// 칠링터치 데미지 약 ( 단발 )
		EF_CR_TOUCH_ED1					=	482	,
		EF_CR_TOUCH_ED2					=	483	,
		EF_CR_TOUCH_LINK				=	484	,			// 칠링터치 영창 ( 양손 )
		//.......................................................................................................
		EF_HEAL_WAVE0					=	485	,			// 힐링 웨이브 약
		EF_HEAL_WAVE1					=	486	,			// 중
		EF_HEAL_WAVE2					=	487	,			// 강
		EF_HEAL_WAVE_ED0				=	488	,			// 힐링 웨이브 받는쪽
		EF_HEAL_WAVE_ED1				=	489	,
		EF_HEAL_WAVE_ED2				=	490	,
		EF_HEAL_WAVE_LINK				=	491	,			// 힐링 웨이브 영창 ( 양손 )
		//.......................................................................................................
		EF_PEAL_DUST0					=	492	,			// 펄리닉 더스트
		EF_PEAL_DUST1					=	493	,
		EF_PEAL_DUST2					=	494	,
		EF_PEAL_DUST_ED0				=	495	,			// 펄리닉 더스트 맞는쪽
		EF_PEAL_DUST_ED1				=	496	,			
		EF_PEAL_DUST_ED2				=	497	,
		EF_PEAL_DUST_LINK				=	498	,			// 펄리닉 더스트 영창
		//.......................................................................................................
		EF_POISON_SEED0					=	499	,			// 포이즌 시드
		EF_POISON_SEED1					=	500	,
		EF_POISON_SEED2					=	501	,
		EF_POISON_SEED_ED0				=	502	,			// 포이즌 시드 데미지
		EF_POISON_SEED_ED1				=	503	,
		EF_POISON_SEED_ED2				=	504	,
		EF_POISON_SEED_LINK				=	505	,			// 포이즌 시드 영창 ( 양손 )
		//.......................................................................................................
		EF_SELF_SHOUT					=	506	,			// 기합
		//.......................................................................................................
		EF_HIDE							=	507	,			// 은신
		EF_MAYUNSAL						=	508	,			// 암연살
		EF_MAYUNSAL_ED					=	509	,			// 암연살 데미지
		EF_SCAPMPER						=	510	,			// 질주
		EF_MOMENT_HIDE					=	511	,			// 월영
		EF_SWORD_GHOST					=	512	,			// 검기 ( 지속 )
		EF_CROSS_COUNTOR				=	513	,			// 크로스카운터(지속)
		EF_BOW_RAIN						=	514	,			// 오월의비 ( 프로그램 )
		EF_BOW_RAINED					=	515	,			// 오월의비 데미지
		EF_SNIPER_BOW					=	516	,			// 저격 ( 캐릭터에 표적판같은 이펙트 )
		EF_SNIPER_BOW_ED				=	517	,			// 저격 데미지
		EF_HEAL_RAIN_BOW				=	518	,			// 치유의비
		EF_HEAL_RAIN_BOWED				=	519	,			// 치유의빛 맞았을때
		EF_COMBO_ADD_BOW				=	520	,			// 각성의 화살
		EF_COMBO_ADD_BOWED				=	521	,			// 각성의 화살 맞았을때
		EF_WHISPER_BOW					=	522	,			// 침묵의 화살
		EF_WHISPER_BOWED				=	523	,			// 침묵의 화살 ( 데미지 )
		EF_CLEAR_BOWED					=	524	,			// 정화의 화살 맞았을때
		EF_CANCEL_BOW					=	525	,			// 해제의 화살
		EF_CANCEL_BOWED					=	526	,			// 해제의 화살 맞을때
		EF_FRAME_STORM					=	528	,			// 프레임 스톰
		EF_FRAME_STORMED				=	529	,			// 프레임 스톰 ( 데미지 )
		EF_LIGHTNIG_SPIRE0				=	530	,			// 라이트닝 스피어 약
		EF_LIGHTNIG_SPIRE1				=	531	,			// 라이트닝 스피어 중
		EF_LIGHTNIG_SPIRE2				=	532	,			// 라이트닝 스피어 강
		EF_LIGHTNIG_SPIREED0			=	533	,			// 라이트닝 스피어 약( 3번 정도 벼락 )
		EF_LIGHTNIG_SPIREED1			=	534	,			// 라이트닝 스피어 중( 3번 정도 벼락 )
		EF_LIGHTNIG_SPIREED2			=	535	,			// 라이트닝 스피어 강( 3번 정도 벼락 )
		EF_ICE_RAIN						=	536 ,			// 아이스레인 
		EF_ICE_RAINED					=	537	,			// 아이스레인 맞았을떄
		EF_BIG_PRESS					=	538	,			// 빅프레스
		EF_BIG_PRESSED					=	539	,			// 빅프레스 맞았을때
		EF_SON_BURSH					=	540	,			// 쏜버쉬
		EF_SON_BURSHED					=	541	,			// 쏜버쉬 데미지
		EF_CLEAR_BOW					=	542	,			// 정화의 화살
		EF_FRAME_STORM_LINK				=	543	,			// 프레임스톰 링크 ( 영창 양손 )
		EF_LIGHTNIG_SPIRE_LINK			=	544	,			// 라이트닝 스피어 링크 ( 영창 양손 )
		EF_ICE_RAIN_LINK				=	545	,			// 아이스레인 링크 ( 영창 양손 지속 )
		EF_BIG_PRESS_LINK				=	546	,			// 빅프레스 링크 ( 영창 양손 )
		EF_SON_BURSH_LINK				=	547	,			// 쏜버쉬 ( 영창 양손 )
		EF_TYNEE_WAVE					=	548	,			// 타이니 웨이브
		EF_TYNEE_WAVE_ED				=	549	,			// 타이니 웨이브 데미지
		EF_TYNEE_WAVE_LINK				=	550	,			// 타이니 웨이브 링크 ( 영창 양손) 
		EF_TELEPORT						=	551	,			// 텔레포트
		EF_SLEEP_STICK					=	552	,			// 슬립
		EF_SLEEP_STICK_ED				=	553	,			// 슬립 데미지
		EF_SLEEP_STICK_LINK				=	554	,			// 슬립 영창 ( 양손 )
		EF_MANA_BUFFERING				=	555	,			// 마나 버퍼링
		EF_RETURN_HOME					=	556	,			// 마을로 순간이동한다
		EF_SELF_HEAL					=	557	,			// 셀프힐링
		EF_DISPELL_BAD					=	558	,			// 디스펠 배드
		EF_DISPELL_BAD_ED				=	559	,			// 디스펠 배드 당함
		EF_DISPELL_BAD_LINK				=	560	,			// 디스펠 배드 링크 ( 지팡이 )
		EF_BRESS						=	561	,			// 블레스
		EF_BRESS_ED						=	562	,			// 블레스 당함 ( 지속 )
		EF_BRESS_LINK					=	563	,			// 블레스 영창
		EF_DETECT						=	564	,			// 디텍트 ( 지속 )
		EF_DETECT_LINK					=	565	,			// 디텍트 영창 ( 링크 지팡 )
		EF_DEPENCE_SHILED				=	566	,			// 디펜스 실드
		EF_DEPENCE_SHILED_ED			=	567	,			// 디펜스 실드 당함 ( 지속 )
		EF_DEPENCE_SHILED_LINK			=	568	,			// 디펜스 실드 영창 ( 지팡이 )
		EF_DEFENSE_AURA					=	569	,			// 디펜스 오로라 ( 거는놈 이펙트 )
		EF_DEFENSE_AURA_ED				=	570	,			// 디펜스 오로라 ( 맞는놈 지속 )
		EF_DEFENSE_LINK					=	571	,			// 디펜스 오로라 영창 ( 지팡이 )
		EF_HOLY_LIGHT					=   572	,			// 홀리라이트 ( 거는사람 )
		EF_HOLY_LIGHT_ED				=	573	,			// 홀리라이트 ( 맞는 사람 )
		EF_HOLY_LIGHT_LINK				=	574	,			// 홀리라이트 ( 영창 )( 지팡이 )
		EF_HEAL_LIGHT					=	575	,			// 치유의빛 ( 거는사람 )
		EF_HEAL_LIGHT_ED				=	576	,			// 치유의빛 맞는사람
		EF_HEAL_LIGHT_LINK				=	577	,			// 치유의빛 영창( 지팡이 )
		EF_UNCOMBO						=	578	,			// 봉인의빛
		EF_UNCOMBO_ED					=	579	,			// 봉인의빛 당하는쪽 ( 단발 )
		EF_UNCOMBO_LINK					=	580	,			// 봉인의빛 링크( 지팡이 )
		EF_FAINT_SELF					=	581	,			// 현혹 ( 지속 )
		EF_SELF_COPY					=	582	,			// 분신
		EF_LIMIT_RUSH					=	583	,			// 한계돌파
		EF_ENERGY0						=	584	,			// 연기파 ( 파티클로 기 하나 , 꼬랑지 
		EF_ENERGY1						=	585	,			// 
		EF_ENERGY2						=	586	,			// 
		EF_ENERGY0_ED					=	587	,			// 연기파 데미지 ( 약 )
		EF_ENERGY1_ED					=	588	,			// 연기파 데미지 ( 중 )
		EF_ENERGY2_ED					=	589	,			// 연기파 데미지 ( 강 )
		EF_ENERGY_LINK					=	590	,			// 양손에 연기파 링크
		EF_HAND_PAR						=	591	,			// 
		EF_HAND_PAR_ED					=	592	,			// 기열파 데미지
		EF_HAND_PAR_LINK				=	593	,			// 기열파
		EF_CIRCLE_KICK					=	594	,			// 선풍 열각
		EF_CIRCLE_KICK_ED				=	595	,			// 선풍 열각 데미지
		EF_CIRCLE_KICK_LINK				=	596	,			// 선풍 열각 링크
		EF_BIG_PRESS_TAIL				=	597	,			// 빅프레스 돌 꼬리
		EF_SPREAD_SPOT					=	598 ,
		EF_TELEPORT_APPEAR				=	599 ,
		EF_SWORD_UP						=	600	,			// 칼 인첸트
		EF_BOW_UP						=	601	,			// 화살 인첸트
		EF_BOOK_UP						=	602	,			// 책 인첸트
		EF_BALL_UP						=	603	,			// 수정구 인첸트
		EF_AXE_UP						=	604	,			// 도끼 인첸트
		EF_STICK_UP						=	605	,			// 지팡이 인첸트
		EF_BOX_DIE						=	606	,			// 박스 죽을때 나오는거
		//..................................................................................................
		// 오베 추가 스킬
		//..................................................................................................
		EF_SHOUT						=	607	,			// 괴성
		EF_SHOUTED						=	608	,			// 괴성 데미지
		EF_STRONG_STICK					=	609	,			// 몽둥이 강타
		EF_STRONG_STICKED				=	610	,			// 몽둥이 강타 데미지
		EF_THROW_STICK					=	611	,			// 몽둥이 던지기
		EF_THROW_STICKED				=	612	,			// 몽둥이 던지기 데미지
		EF_HIT_LAND						=	613	,			// 점프해서 바닥에 떨어지기
		EF_HIT_LANDED					=	614	,			// 점프해서 바닥에 떨어지기 데미지
		EF_NPC_ENTANGLE					=	615	,			// 인탱글
		EF_NPC_ENTANGLEED				=	616	,			// 인탱글 데미지
		EF_NPC_REDTRENT					=	617	,			// 레드트렌트의저주
		EF_NPC_REDTRENT_ED				=	618	,			// 레드트렌트의저주 데미지
		EF_NPC_STONY					=	619	,			// 석화
		EF_NPC_STONYED					=	620	,			// 석화 데미지
		EF_NPC_TREE						=	621	,			// 나무화
		EF_NPC_TREEED					=	622	,			// 나무화 데미지
		EF_FRAME_STRIKE					=	623	,			// 프레임 스트라이크
		EF_FRAME_STRIKE_ED				=	624	,			// 프레임 스트라이크 데미지
		EF_BIG_BUBBLE					=	625	,			// 큰 물방울 뿜기
		EF_BIG_BUBBLEED					=	626	,			// 큰물방울데미지
		EF_NEUTRALIZE					=	627	,			// 무력화
		EF_NEUTRALIZE_ED				=	628	,			// 무력화 데미지
		EF_HAND_DRILL					=	629	,			// 손을맞잡고 드릴처럼 공격
		EF_HAND_DRILLED					=	630	,			// 손을맞잡고 드릴처럼 공격 데미지
		EF_MOON_CURSE					=	631	,			// 달빛의 저주
		EF_MOON_CURSE_ED				=	632	,			// 달빛의 저주 데미지
		EF_SP_SUCTION					=	633	,			// SP 흡수
		EF_SP_SUCTIONED					=	634	,			// SP 흡수 데미지
		EF_HP_SUCTION					=	635	,			// HP 흡수
		EF_HP_SUCTIONED					=	636	,			// HP 흡수 데미지
		EF_LAND_CURSE					=	637	,			// 광역저주
		EF_LAND_CURSE_ED				=	638	,			// 광역저주 데미지
		EF_ROAR							=	639	,			// 광분의 포효
		EF_ROARED						=	640	,			// 광분의 포효 데미지
		EF_LAND_PUT_STICK				=	641	,			// 무기를 땅에 꽂아서 광역
		EF_LAND_PUT_STICKED				=	642	,			// 무기를 땅에 꽂아서 광역 데미지
		EF_CHAIN_LIGHTNING				=	643	,			// 체인 라이트닝
		EF_CHAIN_LIGHTNING_ED			=	644	,			// 체인 라이트닝 데미지
		EF_PARALYSYS					=	645	,			// 마비(부가효과)
		EF_SKILL_DISABLE				=	646	,			// 기절(부가효과)
		EF_ADD_CURSE					=	647	,			// 저주(부가효과)
		EF_ADD_UP						=	648	,			// 상승(부가효과)
		EF_NPC_SOUND_PAR0				=	649	,			// 초음파0
		EF_NPC_SOUND_PAR0_ED			=	650	,			// 초음파0 데미지
		EF_NPC_SOUND_PAR1				=	651	,			// 초음파1
		EF_NPC_SOUND_PAR1_ED			=	652	,			// 초음파1 데미지
		EF_NPC_SOUND_PAR2				=	653	,			// 초음파2
		EF_NPC_SOUND_PAR2_ED			=	654	,			// 초음파2 데미지
		EF_NPC_NATURAL_CRY				=	655	,			// 야생의 포효
		EF_NPC_NATURAL_CRYED			=	656	,			// 야생의 포효 데미지
		EF_NPC_ONE_CUT					=	657	,			// 분노의 일격
		EF_NPC_ONE_CUTED				=	658	,			// 분노의 일격 데미지
		EF_NPC_HAMER_CRASH				=	659	,			// 망치일격
		EF_NPC_HAMER_CRASH_ED			=	660	,			// 망치일격
		EF_ICE_RIP_BLOW					=	661	,			// 차가운입김
		EF_ICE_RIP_BLOWED				=	662	,			// 차가운입김 데미지
		EF_STONY_LINE					=	663	,			// 석화광선
		EF_STONY_LINE_ED				=	664	,			// 석화광선 데미지
		EF_PEL_CURSE					=	665	,			// 펠릭스의 저주
		EF_PEL_CURSE_ED					=	666	,			// 펙릭스의 저주 데미지
		EF_ELECT_CRASH					=	667	,			// 전기 충격
		EF_ELECT_CRASH_ED				=	668	,			// 전기 충격 데미지
		EF_EYE_BEAM						=	669	,			// 아이빔(한명)
		EF_EYE_BEAMED					=	670	,			// 아이빔(한명) 데미지
		EF_EYE_BEAM_LAND				=	671	,			// 아이빔(360도)
		EF_EYE_BEAM_LAND_ED				=	672	,			// 아이빔(360도)
		EF_NPC_CRY_UP					=	673	,			// 포효 - 능력상승(자기한테 거는거)
		EF_NPC_JUMP_ATTACK				=	674	,			// 점프 후 깔고 앉기
		EF_NPC_JUMP_ATTACKED			=	675	,			// 점프 후 깔고 앉기 데미지
		EF_NPC_AB_HPMP					=	676	,			// 흡혈 - 체력, 마력 흡수
		EF_NPC_AB_HPMP_ED				=	677	,			// 흡혈 - 체력, 마력 흡수 데미지
		EF_NPC_UPPER_CUT				=	678	,			// 마라 어퍼~(필)
		EF_NPC_UPPER_CUTED				=	679	,			// 마라 어퍼~(필) 데미지
		EF_HEAL_BUBBLE					=	680	,			// 회복물방울
		EF_HEAL_BUBBLE_ED				=	681	,			// 회복물방울 데미지
		EF_NPC_STRONY					=	682	,			// 견고화 ( 자기한테 )
		EF_FIGHT_STAND					=	683	,			// 전투태세(자기한테)
		EF_MAGIC_DELETE					=	684	,			// 무력화
		EF_MAGIC_DELETEED				=	685	,			// 무력화 데미지
		EF_LAND_SLEEP					=	686	,			// 광역 잠재우기
		EF_LAND_SLEEP_ED				=	687	,			// 광역 잠재우기 데미지
		EF_FROG_SONG					=	688	,			// 개구리 노래
		EF_FROG_SONG_ED					=	689	,			// 개구리 노래 데미지
		EF_NPC_SKILL_CUT				=	690	,			// 3단 연속베기
		EF_NPC_SKILL_CUT_ED				=	691	,			// 3단연속베기 데미지
		EF_JUMP_HIT_HAND_LAND			=	692	,			// 점프 후 바닥 내리쳐서 광역 공격
		EF_JUMP_HIT_HAND_LANDED			=	693	,			// 점프 후 바닥 내리쳐서 광역 공격
		EF_NPC_TWO_HIT					=	694	,			// 방패 가격 후 3단 찌르기 
		EF_NPC_TWO_HITED				=	695	,			// 방패 가격 후 3단 찌르기 데미지
		EF_BIG_SWORD					=	696	,			// 대검 공격
		EF_BIG_SWORD0_ED				=	697	,			// 대검 공격 데미지0
		EF_BIG_SWORD1_ED				=	698	,			// 대검 공격 데미지1
		EF_BIG_SWORD2_ED				=	699	,			// 대검 공격 데미지2
		EF_MIRACLE						= 	700 ,			// 기적 발동 이펙트
		EF_MIRACLE_ED					=	701 ,			// 기적 지속 이펙트
		EF_CHANGE_CLASS0				=	702 ,			// 전직 이펙트 0
		EF_CHANGE_CLASS1				=	703 ,			// 전직 이펙트 1
		EF_BIG_NPC_ATTACK0				=	704	,			// 거대몬스터 공격
		EF_BIG_NPC_ATTACK0ED			=	705	,			// 거대몬스터 공격 당함
		EF_BIG_NPC_APPEAR0				=	706	,			// 거대몬스터 나타날때
		EF_BIG_NPC_ATTACK1				=	707	,			// 거대몬스터 공격(건물)
		EF_BIG_NPC_SKILL0				=	708 ,			// 거대몬스터 스킬 공격(용)
		EF_BIG_NPC_SKILL0_ED			=	709 ,			// 거대몬스터 스킬 공격 당함(용)
		EF_BIG_NPC_SKILL1				=	710 ,			// 거대몬스터 스킬 공격(건물)
		EF_BIG_NPC_SKILL1_ED			=	711 ,			// 거대몬스터 스킬 공격 당함(건물)
		//....................................................................................
		// 날개 이펙트
		//....................................................................................
		EF_WING0						=   712 ,			// 날개 테스트
		//....................................................................................
		EF_BLOOD_RUNAWAY1				=   713 ,			// 피의 폭주
		EF_LIVE_MIND1					=	714	,			// 불굴의 의지
		//....................................................................................
		// 불꽃 테스트
		//....................................................................................
		EF_FIREFLOWER0					=	715	,			// 불꽃 큰거
		//....................................................................................
		// 유료 무기 아이템 공격 이펙트
		//....................................................................................
		EF_SI_ITEM_ATTACK0				=	716	,			// 뿅망치 공격
		EF_SI_ITEM_ATTACKED0			=	717	,			// 뿅망치 데미지
		EF_SI_ITEM_ATTACK1				=	718	,			// 지적봉 공격
		EF_SI_ITEM_ATTACKED1			=	719	,			// 지적봉 데미지
		EF_SI_ITEM_ATTACK2				=	720	,			// 하리센 공격
		EF_SI_ITEM_ATTACKED2			=	721	,			// 하리센 데미지
		EF_SI_ITEM_ATTACK3				=	722	,			// 물고기 공격
		EF_SI_ITEM_ATTACKED3			=	723	,			// 물고기 데미지
		//....................................................................................
		EF_FIREFLOWER1					=	724	,			// 불꽃 작은거
		//....................................................................................
		EF_HOLY_APPEAR					=	725	,			// 신수 나타날때 이펙트
		//....................................................................................
		EF_HOLY_DISAPPEAR				=	726	,			// 신수 소황 해제
		EF_HOLY_LEVEL_UP				=	727	,			// 신수 레벨업 이펙트
		
		EF_MN_GUAD_ATTACK0				=	728	,			// 밀레나지키는NPC근거리공격
		EF_MN_GUAD_ATTACKED00			=	729	,			// 밀레나지키는NPC근거리공격당함
		EF_MN_GUAD_ATTACKED01			=	730	,			// 밀레나지키는NPC근거리공격당함
		EF_MIN_GUAD_SKILL				=	731	,			// 밀레나지키는NPC원거리공격
		EF_MIN_GUAD_SKILLED				=	732	,			// 밀레나지키는NPC원거리공격당함

		EF_RI_GUAD_ATTACK0				=	733	,			// 레인지키는NPC근거리공격
		EF_RI_GUAD_ATTACKED00			=	734	,			// 레인나지키는NPC근거리공격당함
		EF_RI_GUAD_ATTACKED01			=	735	,			// 레인나지키는NPC근거리공격당함
		EF_RI_GUAD_SKILL				=	736	,			// 레인나지키는NPC원거리공격
		EF_RI_GUAD_SKILLED				=	737	,			// 레인나지키는NPC원거리공격당함

		EF_HOLY_AURA					=	738	,			// 프로그램에서 바로 적용
		EF_HOLY_AURAED0					=	739	,			// (물리/마법공격력)
		EF_HOLY_AURAED1					=	740	,			// (물리마법방어력)
		EF_HOLY_AURAED2					=	741	,			// (공격속도)
		EF_HOLY_AURAED3					=	742	,			// (획득경험치/명성치)

		//....................................................................................
		// 신수 생성 될때 A ( 공격 ) , B ( 방어 ) , C ( 속도 ) , D ( 경험 )
		//....................................................................................
		EF_HOLY_CREATE00				=	743	,			// A
		EF_HOLY_CREATE01				=	744	,			// A
		EF_HOLY_CREATE02				=	745	,			// A
		EF_HOLY_CREATE03				=	746	,			// A
		EF_HOLY_CREATE04				=	747	,			// A
		//....................................................................................
		EF_HOLY_CREATE10				=	748	,			// B
		EF_HOLY_CREATE11				=	749	,			// B
		EF_HOLY_CREATE12				=	750	,			// B
		EF_HOLY_CREATE13				=	751	,			// B
		EF_HOLY_CREATE14				=	752	,			// B
		//....................................................................................
		EF_HOLY_CREATE20				=	753	,			// C
		EF_HOLY_CREATE21				=	754	,			// C
		EF_HOLY_CREATE22				=	755	,			// C
		EF_HOLY_CREATE23				=	756	,			// C
		EF_HOLY_CREATE24				=	757	,			// C
		//....................................................................................
		EF_HOLY_CREATE30				=	758	,			// D
		EF_HOLY_CREATE31				=	759	,			// D
		EF_HOLY_CREATE32				=	760	,			// D
		EF_HOLY_CREATE33				=	761	,			// D
		EF_HOLY_CREATE34				=	762	,			// D
		//....................................................................................
		EF_NPC_STAND_ATTACK				=	763	,			// NPC 기본공격 데미지 이펙트만 표시할때
		EF_NPC_FLY_ATTACK0				=	764	,			// NPC화이어볼 ( 오른손 )
		EF_NPC_FLY_ATTACK1				=	765	,			// NPC화이어볼 ( 왼  손 )
		EF_NPC_FLY_HAUPAI_LR			=	766 ,			// 하르피아 왼손 오른손
		EF_NPC_FLY_HAUPAI_RR			=	767 ,			// 하르피아 오른손 양손
		//....................................................................................
		// NPC 스킬
		//....................................................................................
		EF_NPC_NERO_GAS					=	768	,			// 네로쉬칸 가스 발사
		EF_NPC_NERO_GASED				=	769	,			// 네로쉬칸 가스 발사 당함
		EF_NPC_NERO_STRONG				=	770	,			// 네로쉬칸 견고화
		EF_NPC_NERO_STRONGED			=	771	,			// 네로쉬칸 견고화 당함
		EF_NPC_NERO_DIE_PUNCH			=	772	,			// 네로쉬칸 죽음의 일격
		EF_NPC_NERO_DIE_PUNCHED			=	773	,			// 네로쉬칸 죽음의 일격 당함
		EF_NPC_HARU_MU					=	774	,			// 하르피아 무력화
		EF_NPC_HARU_MUED				=	775	,			// 하르피아 무력화 당함
		EF_NPC_HARU_HP					=	776	,			// 하르피아 HP 흡수
		EF_NPC_HARU_HPED				=	777	,			// 하르피아 HP 흡수 당함
		EF_NPC_HARU_LIGHT				=	778	,			// 하르피아 멀티 라이트닝
		EF_NPC_HARU_LIGHTED				=	779	,			// 하르피아 멀티 라이트닝 당함
		EF_NPC_BIZ_ELEC					=	780	,			// 비즈XP-300 전기충격
		EF_NPC_BIZ_ELECED				=	781	,			// 비즈XP-300 전기충격 당함
		EF_NPC_BIZ_BEAM					=	782	,			// 비즈XP-610 아이 빔
		EF_NPC_BIZ_BEAMED				=	783	,			// 비즈XP-610 아이 빔 당함
		EF_NPC_BIZ_AMOTION				=	784	,			// 비즈XP-900 전투태세
		EF_NPC_BIZ_AMOTIONED			=	785	,			// 비즈XP-900 전투태세 당함
		EF_NPC_BIS_THREE				=	786	,			// 비스카그 3단 베기
		EF_NPC_BIS_THREEED				=	787	,			// 비스카그 3단 베기 당함
		EF_NPC_BIS_JUMP_AT				=	788	,			// 비스카그 점프 광역
		EF_NPC_BIS_JUMP_ATED			=	789	,			// 비스카그 점프 광역 당함
		EF_NPC_BIS_LAND_AT				=	790	,			// 비스카그 광역 공격
		EF_NPC_BIS_LAND_ATED			=	791	,			// 비스카그 광역 공격 당함
		EF_SKILL_ACTION					=	792	,			// 이펙트 효과없고 스킬만 프로그램에서처리
		//....................................................................................
		EF_FAST_SWORD					=	793	,			// 신속의대검
		EF_FAST_BOW						=	794	,			// 신속의 화살 ( 프로그램에서 처리 )
		EF_FAST_BOWED					=	795	,			// 화살맞았을때
		EF_FAST_AWAY					=	796	,			// 회피
		//....................................................................................
		EF_MN_POINT_DEAD				=	797	,			// 밀레나 고지 죽을때
		EF_RN_POINT_EDAD				=	798	,			// 레인 고지 죽을때
		//....................................................................................
		EF_EMBLEM_FLAG					=	799	,			// 엠블렘 깃발
		
		//....................................................................................
		EF_GRIZZL_BAS_ATT				=   801 ,			// 그리즐 기본공격
		EF_GRIZZL_BAS_ATTED_0			=	802	,			// 그리즐 기본데미지 약 	
		EF_GRIZZL_BAS_ATTED_2			=	803	,			// 그리즐 기본데미지 강		
		EF_F_GRIZZL_BAS_ATT				=	804	,			// 그리즐 투사 기본공격	
		EF_F_GRIZZL_BAS_ATTED_0			=	805 ,			// 그리즐 투사 기본데미지 약	
		EF_F_GRIZZL_BAS_ATTED_2			=	806 ,			// 그리즐 투사 기본데미지 강	
		EF_M_GRIZZL_BAS_ATT				=	807	,			// 우두머리 그리즐 기본공격
		EF_M_GRIZZL_BAS_ATTED_0			=	808	,			// 우두머리 그리즐 기본데미지 약	
		EF_M_GRIZZL_BAS_ATTED_2			=	809	,			// 우두머리 그리즐 기본데미지 강 	
		EF_CHIME_ANT_BAS_ATT			=	810 ,			// 키메라 엔트 기본공격	
		EF_CHIME_ANT_BAS_ATTED_0		=	811 ,			// 키메라 엔트 기본공격 데미지 약
		EF_CHIME_ANT_BAS_ATTED_2		=	812 ,			// 키메라 엔트 기본공격 데미지 강
		//....................................................................................
		EF_SONG_GRIZZL					=	813	,			// 그리즐의 노래
		EF_SONG_GRIZZL_ED				=	814 ,		    // 그리즐의 노래 당함
		EF_HIT_GRIZZL					=	815 ,			// 그리즐의 일격
		EF_HIT_GRIZZL_ED				=	816 ,			// 그리즐의 일격 당함
		EF_RECOVER_GRIZZL				=	817 ,			// 그리즐의 회복
		EF_RECOVER_GRIZZL_ED			=	818 ,			// 그리즐의 회복 당함
		EF_BIG_SHOCK_C_ANT				=	819	,			// 키메라 엔트의 광역 공격
		EF_BIG_SHOCK_C_ANT_ED			=	820 ,			// 키메라 엔트의 광역 공격 당함
		//....................................................................................
		// 신수 생성 이펙트
		//....................................................................................
		EF_HOLY_CREATE40				=	821	,			//	E 신수 생성시
		EF_HOLY_CREATE41				=	822	,			//	E 신수 생성시
		EF_HOLY_CREATE42				=	823	,			//	E 신수 생성시
		EF_HOLY_CREATE43				=	824	,			//	E 신수 생성시
		EF_HOLY_CREATE44				=	825	,			//	E 신수 생성시
		//....................................................................................
		
		EF_PET_CREATE					=	826 ,			//  펫 생성시
		EF_PET_DESTROY					=   827 ,			//  펫 소멸시
		EF_PET_LEVELUP					=	828 ,			//  펫 레벨업시
		
		// 방어형 펫	
		EF_DEFENSE_PET_BMOTION			=	829 ,			//  방어형 펫 기본동작 이펙트		
		
		//.......................................................................................................
		EF_POPOI_ATTACKED				=   830,			//	포포이 공격대미지
		
		EF_EGGBIL_HILLING				=   831,			// 	에그빌 힐		
		EF_PINAPOA_HEART				=   832,			//  피나포어 오믈렛 이펙트		
		EF_POPOI_JUMP					=	833,			//	포포이 도약
		EF_POPOI_3ATTCKFIRST			=	834,			//  포포이 3단공격 첫번째
		EF_EGGBIL_HILLMOTION			=	835,			//	에그빌 힐 모션 		
		
		EF_POPOI_ATTACK_0				=	836	,			// 포포이 스킬공격1
		EF_POPOI_ATTACK_1				=   837	,			// 포포이 스킬공격2
		EF_POPOI_ATTACK_2				=   838	,			// 포포이 스킬공격3
						
		EF_EGGBIL_HILL0					=   839 ,			// 에그빌 힐1 - 일반 힐	
		EF_EGGBIL_HILL1					=	840 ,			// 에그빌 힐2 - 3단계부터의 힐
		
		EF_RIDE_ON						=   841 ,			// 라이딩 할때 발생 이펙트
		EF_RIDE_OFF						=   842 ,			// 라이딩에서 일반상태 복귀 이펙트 
		
		EF_KOREA_BACK_EFFECT			=   843 ,			// 한국버전 - 캐릭터 선택화면 뒷이펙트

		EF_TIGER_ATTACKED_1				=   844	,			// 호랑이 기본공격1
		EF_TIGER_ATTACKED_2				=	845 ,			// 호랑이 기본공격2
		EF_TIGER_ATTACKED_3				=   846	,			// 호랑이 기본공격3
		EF_TIGER_ATTACKED_4				=	847 ,			// 호랑이 기본공격4

		EF_TIGER_SKILL_2				=   848 ,			// 호랑이 스킬2
		EF_TIGER_SKILL_3				=   849 ,			// 호랑이 스킬3
		EF_TIGER_SKILL_4				=   850 ,			// 호랑이 스킬4
		
		EF_FOX_DEFENSED_1				=	851	,			// 사막여우 기본방어1
		EF_FOX_DEFENSED_2				=	852	,			// 사막여우 기본방어2
		EF_FOX_DEFENSED_3				=	853	,			// 사막여우 기본방어3
		EF_FOX_DEFENSED_4				=	854	,			// 사막여우 기본방어4

		EF_FOX_SKILL_1					=   855 ,			// 사막여우 스킬2
		EF_FOX_SKILL_2					=   856 ,			// 사막여우 스킬3
		EF_FOX_SKILL_3					=   857 ,			// 사막여우 스킬4
		//.......................................................................................................
		EF_DEFENSED_ENCHANT				=	858 ,			// 방어구 인첸트 이펙트 
		
		EF_FIRE_RAIN					=   859 ,			// 화염의비		
		EF_FIRE_RAINED					=   860 ,			// 화염의비 당했을때	
		EF_FIRE_RAIN_LINK				=   861 ,			// 화염의비 스펠이펙트
		
		EF_ICE_FIELD					=   862	,			// 아이스 필드 - 바닥에 생기는거
		EF_ICE_FIELD_SMOG				=   863 ,			// 아이스 필드 스모그					
		EF_ICE_FIELDED					=	864 ,			// 아이스 필드 당했을때
		EF_ICE_FIELD_LINK				=   865 ,			// 아이스 필드 스펠이펙트		
		EF_ICE_SPEAR					=   866 ,			// 아이스 스피어 - 얼음창 꼬리			
		EF_ICE_SPEARED					=   867 ,			// 아이스 스피어 당했을때
		EF_ICE_SPEAR_LINK				=   868 ,			// 아이스 스피어 스펠이펙트			
		EF_LIGHT_STORM					=   869 ,			// 라이트 스톰 제일긴거
		EF_LIGHT_STORMED				=   870 ,			// 라이트 스톰 당했을때					
		EF_LIGHT_STORM_LINK				=   871 ,			// 라이트 스톰 스펠이펙트		
		EF_STONE_RAIN					=   872 ,			// 운석의 비 - 지형에 맞았을때
		EF_STONE_RAIN_TAIL				=   873 ,			// 운석의 비꼬리		
		EF_STONE_RAINED					=   874 ,			// 운석의 비 당했을때		
		EF_STONE_RAIN_LINK				=   875 ,			// 운석의 비 스펠이펙트		
		EF_WIND_BUSH					=   876 ,			// 윈드 버쉬 - 하나의 회오리바람 단위
		EF_WIND_BUSHED					=	877 ,			// 윈드 버쉬 당했을때
		EF_WIND_BUSH_LINK				=   878 ,			// 윈드 버쉬 스펠이펙트
		EF_ROUND_FIRE					=   879 ,			// 라운드 파이어 - 하나의 화염이펙트 단위
		EF_ROUND_FIRED					=   880 ,			// 라운드 파이어 당했을때		
		EF_FIRE_ARMOR					=	881	,			// 파이어 아머
		EF_FIRE_ARMOR_ED				=	882	,			// 파이어 아머 당함 ( 지속 )
		EF_FIRE_ARMOR_LINK				=	883	,			// 파이어 아머 스펠 이펙트		
		EF_ROUND_LIGHT					=   884	,			// 라운드 라이트
		EF_ROUND_LIGHTED				=	885 ,			// 라운드 라이트 당했을때		
		EF_LIGHT_SHIELD					=	886	,			// 라이트 실드
		EF_LIGHT_SHIELD_ED				=	887	,			// 라이트 실드 당함 ( 지속 )
		EF_LIGHT_SHIELD_LINK			=	888	,			// 라이트 실드 스펠 이펙트
		EF_SHIELD_STONE					=   889 ,			// 실드 스톤
		EF_SHIELD_STONE_ED				=   890 ,			// 실드 스톤 당함 ( 지속 )
		EF_SHIELD_STONE_LINK			=   891 ,           // 실드 스톤 스펠 이펙트		
		EF_CAST_STONE					=   892 ,			// 캐스트 스톤 - 돌덩어리 꼬리
		EF_CAST_STONEED					=   893 ,			// 캐스트 스톤 당했을때		
		EF_PAIN_EARTHED					=	894 ,			// 대지의 고통 당했을때
		EF_LIGHT_STORM_02				=   895 ,			// 라이트 스톰 두번째 긴거
		EF_LIGHT_STORM_03				=   896 ,			// 라이팅 스톰 짧은거		
		EF_WIND_DUST_BUSH				=   897 ,			// 윈드 버쉬 먼지 회오리		
		
		EF_STONE_RAIN_STONE				=   901	,			// 운석의 비 - 돌 튀김
		EF_STONE_RAIN_RING				=   902 ,			// 운석의 비 - 중앙에 한번 링 퍼짐	
		EF_FIRE_SMASH_LAND				=   903	,			// 불로 갈라진 바닥
		EF_FIRE_RANDOM_FIRE				=	904 ,			// 랜덤한 이글이글 불
		
		EF_EARTH_BIND					=   905	,			// 대지의 속박 - 바닥에 깔린거
		EF_EARTH_BIND_SMOG				=	906 ,			// 대지의 속박 - 안개 단위		
		EF_RANDOM_ARROW					=	907	,			// 난사 - 대지속성의 파티클
		EF_RANDOM_ARROWED				=   908 ,			// 난사 당했을때

		EF_HOLY_BOMB_BALL				=   909 ,			// 신성한 폭발-날라가는 공
		EF_HOLY_BOMB_ED					=   910 ,			// 신성한 폭발 당했을때
		EF_HOLY_BOMB_LINK				=	955	,

		EF_INDONESIA_EVENT				=   911 ,			// 사랑의 묘약
		EF_LIGHT_LANDSPARK				=   912 ,		    // 라이트 스톰, 라운드 라이트 바닥 스파크

		//EF_WRATH_BOMB					=   913 ,			// 분노폭발
		EF_GLOVE_DESTRUCTION_ED			=   914 ,			// 장갑파괴
		EF_CIRCLE_SHIELD				=   915 ,			// 서클쉴드		
		EF_REVENGE_SHIELD				=   916 ,			// 복수
		EF_WRATH_KNIFE_ATTACK			=	917 ,			// 분노의검진
		EF_CIRCLE_CRASH					=   918 ,			// 써클크래쉬
		EF_BLOOD_CALLRING				=   919 ,			// 블러드콜링
		
		EF_QUICK_SWORD					=   920 ,			// 신속의 검
		EF_CON_CROSSCUT					=   921 ,			// 연속 횡베기
		
		EF_GLOVE_DESTRUCTION			=   922 ,			// 장갑파괴 시작
		EF_REVENGE_SHIELD_ED			=   923 ,			// 복수 당했을때
		EF_WRATH_KNIFE_ATTACK_TILE		=   924 ,			// 분노의 검진 바닥
		EF_WRATH_KNIFE_ATTACK_ED		=   925 ,			// 분노의 검진 당했을때
		
		EF_PAIN_EARTH					=   926 ,			// 대지의 고통
		
		EF_PARALYSIS_BOW				=	927 ,			// 마비의 화살
		EF_PARALYSIS_BOWED				=   928 ,			// 마비의 화살 당했을때

		EF_FIRE_FLAME_KICK				=   929 ,			// 화염열각
		EF_FIRE_FLAME_KICKED			=   930 ,           // 화염열각 당했을때
		EF_FIRESTORM_SMASH				=	931	,			// 열풍강타
		EF_FIRESTORM_SMASHED			=	932 ,			// 열풍강타 당했을때
		EF_SPIRIT_FIRE_SMACK			=	933	,			// 기열연타
		EF_SPIRIT_FIRE_SMACKED			=	934	,			// 기열연타 당했을때
		EF_SPIN_FIRE_KICK				=	935 ,			// 회전열각
		EF_SPIN_FIRE_KICKED				=	936	,			// 회전열각 당했을때
		
		EF_CIRCLE_CHANGE				=	937	,			// 서클체인지
		EF_POISON_BOW					=	938	,			// 독화살
		EF_POISON_BOWED					=	939	,			// 독화살 당했을때

		EF_TRIPLE_DARKNESS				=	940 ,			// 트리플다크니스
		EF_TRIPLE_DARKNESSED			=	941 ,			// 트리플다크니스 당했을때
		EF_TRIPLE_FIRE					=	942 ,			// 트리플파이어
		EF_TRIPLE_FIREED				=   943 ,			// 트리플파이어 당했을때
		EF_ONE_DARKNESS					=	944 ,			// 다크니스
		EF_ONE_DARKNESSED				=   945 ,			// 다크니스 당했을때
		
		EF_TREE_CON_KICK				=	946 ,			// 삼연각
		EF_SLASH_DOWN					=   947 ,			// 슬래쉬 다운
		EF_SLASH_UP						=   948 ,			// 슬래쉬 업
		EF_TRIPLE_COUNT					=   949 ,			// 트리플 카운트
		
		EF_ICE_BOW_RAIN					=   950 ,			// 얼음의 화살비
		EF_ICE_BOW_RAINED				=   951 ,			// 얼음의 화살비 맞았을때	

		EF_WRATH_BOMB					= 952,				// 분노폭발 
		EF_WRATH_BOMB_ED				= 953,				// 분노폭발 맞았을때 
		EF_WRATH_BOMB_LINK				= 954,				// 분노폭발 시작할때
		
		EF_DARKNESSED01					= 956,				//다크니스 맞을때 01 
		EF_DARKNESSED02					= 957,				//다크니스 맞을때 02 
		EF_DARKNESSED03					= 958,				//다크니스 맞을때 03
		
		EF_ROTATEKICK					= 959,				//위성각 이펙트

		EF_DOUBLESHOT					= 963,				//더블샷 
		EF_DOUBLESHOT_ED				= 964,				//더블샷 맞을때 
		
		EF_HIDE_SENSOR					= 965 ,				//은신 감지

		///-- 콜로니 오브젝트 NPC 생성링크 이펙트
		EF_COLONYCORE_L1				= 966 ,				//콜로니코어 레벨1
		EF_COLONYSUBCORE_L1				= 967 ,				//콜로니 서브코어 레벨1
		EF_COLONYCORE_L2				= 968 ,				//콜로니코어 레벨2
		EF_COLONYSUBCORE_L2				= 969 ,				//콜로니서브코어 레벨2
		
		///-- 콜로니 가드타워 스킬 이펙트
		EF_COLONYGTOWER_L1_SKILL		= 970 ,				//콜로니 가드타워 레벨1 - 스킬
		EF_COLONYGTOWER_L1_SKILLED		= 971 ,				//콜로니 가드타워 레벨1 - 스킬 맞을때
		EF_COLONYGTOWER_L2_SKILL		= 972 ,				//콜로니 가드타워 레벨2 - 스킬
		EF_COLONYGTOWER_L2_SKILLED		= 973 ,				//콜로니 가드타워 레벨2 - 스킬 맞을때
		EF_COLONYGTOWER_L3_SKILL		= 974 ,				//콜로니 가드타워 레벨3 - 스킬
		EF_COLONYGTOWER_L3_SKILLED		= 975 ,				//콜로니 가드타워 레벨3 - 스킬 맞을때

		///-- 콜로니 거스트 판처 이펙트
		EF_GUST_PAN_ATTACK				= 976 ,				//콜로니 거스트판쳐 기본공격
		EF_GUST_PAN_ATTACK_PERCUSSION	= 977 ,				//콜로니 거스트판쳐 기본공격 격발 이펙트
		EF_GUST_PAN_ATTACK_EXPLOSION	= 978 ,				//콜로니 거스트판쳐 기본공격 지형 범위타격 이펙트
		EF_GUST_PAN_ATTACKED			= 979 ,				//콜로니 거스트판쳐 기본공격 맞았을때
		EF_GUST_PAN_SKILL				= 980 ,				//콜로니 거스트판쳐 스킬
		EF_GUST_PAN_SKILL_PERCUSSION	= 981 ,				//콜로니 거스트판쳐 스킬 격발 이펙트
		EF_GUST_PAN_SKILL_EXPLOSION		= 982 ,				//콜로니 거스트판쳐 스킬 지형 범위타격 이펙트
		EF_GUST_PAN_SKILLKED			= 983 ,				//콜로니 거스트판쳐 스킬 맞았을때

		///-- 콜로니 거신병 이펙트
		EF_GIANT_GOLEM_ATTACK			= 984 ,				//콜로니 거신병 기본공격
		EF_GIANT_GOLEM_ATTACK_EXPLOSION	= 985 ,				//콜로니 거신병 기본공격 지형 범위타격 이펙트
		EF_GIANT_GOLEM_ATTACKED			= 986 ,				//콜로니 거신병 기본공격 맞았을때
		EF_GIANT_GOLEM_SKILL			= 987 ,				//콜로니 거신병 스킬
		EF_GIANT_GOLEM_SKILL_EXPLOSION	= 988 ,				//콜로니 거신병 스킬 지형 범위타격 이펙트
		EF_GIANT_GOLEM_SKILLED			= 989 ,				//콜로니 거신병 스킬 맞았을때
		
		EF_GUST_PAN_GET_POWER			= 990,				//콜로니 거스트 판처 발사전 에너지모으는거
		
		EF_GIANT_GOLEM_RIGHT_HAND		= 991,				//콜로니 거신병 오른손에 붙는 이펙트
		EF_GIANT_GOLEM_LEFT_HAND		= 992,				//콜로니 거신병 왼손에 붙는 이펙트
		
		EF_PAIN_HOLLY					= 993,				//신성한 고통
		EF_PAIN_HOLLYED					= 994,				//신성한 고통 당했을때
		
		EF_BUNCH_STRENGTH				= 995,				//마인의 권술
		
		///-- 저주받은 땅 레이드 몬스터 스킬
		EF_B_M_BASE_ATTACK				= 996,				//본 머더 도검류 - 기본공격 당했을때
		EF_B_M_SOLDIER_THRUST			= 997,				//본 머더 병사 - 찌르기
		EF_B_M_SOLDIER_THRUSTED			= 998,				//본 머더 병사 - 찌르기 당했을때
		EF_B_M_SOLDIER_WEAK_CUT			= 999,				//본 머더 병사 - 급소베기
		EF_B_M_SOLDIER_WEAK_CUTED		= 1000,				//본 머더 병사 - 급소베기 당했을때
		EF_B_M_SOLDIER_THRUST_CUT		= 1001,				//본 머더 병사 - 찔러베기
		EF_B_M_SOLDIER_THRUST_CUTED		= 1002,				//본 머더 병사 - 찔러베기 당했을때
		EF_B_M_WARRIOR_TURN_CUT			= 1003,				//본 머더 전사 - 회전베기
		EF_B_M_WARRIOR_TURN_CUTED		= 1004,				//본 머더 전사 - 회전베기 당했을때
		EF_B_M_WARRIOR_X1_CUT			= 1005,				//본 머더 전사 - X베기1 
		EF_B_M_WARRIOR_X1_CUTED			= 1006,				//본 머더 전사 - X베기1 당했을때 - 첫타
		EF_B_M_WARRIOR_X2_CUT			= 1007,				//본 머더 전사 - X베기2
		EF_B_M_WARRIOR_X2_CUTED			= 1008,				//본 머더 전사 - X베기2 당했을때 - 첫타
		EF_B_M_GUARD_RESURRECTION		= 1009,				//본 머더 호의병 - 리저렉션 이펙트
		EF_B_M_BOSS_FIRE_STORM			= 1010,				//본 머더 보스 - 화염폭풍
		EF_B_M_BOSS_FIRE_STORMED		= 1011,				//본 머더 보스 - 화염폭풍 당했을때
		EF_B_ARCHER_BASE_ATTACK			= 1012,				//본 아처류 - 기본공격 당했을때 
		EF_B_ARCHER_FIRE_ARROW			= 1013,				//불타버린 본 아처 - 불화살 - 불 꼬리필요함
		EF_B_ARCHER_FIRE_ARROWED		= 1014,				//불타버린 본 아처 - 불화살 당했을때
		EF_B_ARCHER_FIRST_AID			= 1015,				//본 아처 치료사 - 응급치료 이펙트
		EF_B_ARCHER_DECAY_ARROW			= 1016,				//부패한 본아처 - 부패의 화살 - 부패관련 꼬리필요함
		EF_B_ARCHER_DECAY_ARROWED		= 1017,				//부패한 본아처 - 부패의 화살 당했을때
		EF_B_ARCHER_PAIN_ARROW			= 1018,				//역병걸린 본아처 - 고통의 화살 - 독관련 꼬리필요함
		EF_B_ARCHER_PAIN_ARROWED		= 1019,				//역병걸린 본아처 - 고통의 화살 당했을때
		EF_B_ARCHER_DARK_ARROW			= 1020,				//굶주린 본아처 - 암흑의 화살 - 암흑관련 꼬리필요함
		EF_B_ARCHER_DARK_ARROWED		= 1021,				//굶주린 본아처 - 암흑의 화살 당했을때
		EF_B_ARCHER_CURSE_ARROW			= 1022,				//저주받은 본아처 - 저주의 화살 저주관련꼬리 필요함
		EF_B_ARCHER_CURSE_ARROW_LAND	= 1023,				//저주받은 본아처 - 저주의 화살 땅에 부딧힐때 이펙트
		EF_B_ARCHER_CURSE_ARROWED		= 1024,				//저주받은 본아처 - 저주의 화살 당했을때
		EF_B_ARCHER_PARALYSIS_ARROW		= 1025,				//광포한 본아처 - 마비의 화살 - 마비관련 꼬리필요함
		EF_B_ARCHER_PARALYSIS_ARROWED	= 1026,				//광포한 본아처 - 마비의 화살 당했을때
		EF_B_BOS_ARCHER_RANDOM_ARROW	= 1027,				//본아처 보스 - 난사 - 난사관련 꼬리필요함
		EF_B_BOS_ARCHER_RANDOM_ARROWED	= 1028,				//본아처 보스 - 난사 맞았을때
		EF_B_M_WARRIOR_X1_CUTED2		= 1029,				//본 머더 전사 - X베기1 당했을때 - 두번째타	
		EF_B_M_WARRIOR_X2_CUTED2		= 1030,				//본 머더 전사 - X베기2 당했을때 - 두번째타
		EF_B_M_WAR_TURN_FIRST_QUARTER	= 1031,				//본 머더 전사 - 회전베기시 반월효과
		EF_B_JAHE_CRAZY_FEN_BEFORE		= 1032,				//본 자헤딘 - 광폭의 검술 칼끝에 모이는거
		EF_B_JAHE_CRAZY_FEN_AFTER		= 1033,				//본 자헤딘 - 광폭의 검술 - 불꽃 회오리 이펙트
		EF_B_JAHE_CRAZY_FENED			= 1034,				//본 자헤딘 - 광폭의 검술 - 당했을때
		EF_B_SKEL_BAIN_DARK_STORM		= 1035,				//스컬베인 - 암흑폭풍
		EF_B_SKEL_BAIN_DARK_STORMED		= 1036,				//스컬베인 - 암흑폭풍 당했을때
		
		EF_ANIWING0						= 1037,				//애니적용 날개
		
		///-- 거대몹 도그마베인 스킬
		EF_DOGMA_L1_BASIC_ATTACK		= 1038,				//도그마베인 - 1단계 기본공격
		EF_DOGMA_L1_BASIC_ATTACKED		= 1039,				//도그마베인 - 1단계 기본공격 당했을때
		EF_DOGMA_L1_CRI_ATTACK			= 1040,				//도그마베인 - 1단계 크리티컬 공격
		EF_DOGMA_L1_CRI_ATTACKED		= 1041,				//도그마베인 - 1단계 크리티컬 공격 당했을때
		
		EF_DOGMA_L1_FIRERAIN			= 1042,				//도그마베인 - 1단계 파이어레인
		EF_DOGMA_L1_FIRERAINED			= 1043,				//도그마베인 - 1단계 파이어레인 당했을때
		EF_DOGMA_L1_FRAME_STORM			= 1044,				//도그마베인 - 1단계 프레임스톰
		EF_DOGMA_L1_FRAME_STORMED		= 1045,				//도그마베인 - 1단계 프레임스톰 당했을때

		EF_DOGMA_L2_BASIC_ATTACK		= 1046,				//도그마베인 - 2단계 기본공격
		EF_DOGMA_L2_BASIC_ATTACKED		= 1047,				//도그마베인 - 2단계 분노의 일격 당했을때
		EF_DOGMA_L2_CRI_ATTACK			= 1048,				//도그마베인 - 2단계 크리티컬 공격
		EF_DOGMA_L2_CRI_ATTACKED		= 1049,				//도그마베인 - 2단계 크리티컬 공격 당했을때

		EF_DOGMA_L2_WRATH_ONECUT		= 1050,				//도그마베인 - 2단계 분노의 일격
		EF_DOGMA_L2_WRATH_ONECUTED		= 1051,				//도그마베인 - 2단계 분노의 일격 당했을때
		EF_DOGMA_L2_SWORD_FLASH			= 1052,				//도그마베인 - 2단계 검진
		EF_DOGMA_L2_SWORD_FLASHED		= 1053,				//도그마베인 - 2단계 검진 당했을때

		EF_DOGMA_L3_BASIC_ATTACK		= 1054,				//도그마베인 - 3단계 기본공격
		EF_DOGMA_L3_BASIC_ATTACKED		= 1055,				//도그마베인 - 3단계 기본공격 당했을때
		EF_DOGMA_L3_CRI_ATTACK			= 1056,				//도그마베인 - 3단계 크리티컬 공격
		EF_DOGMA_L3_CRI_ATTACKED		= 1057,				//도그마베인 - 3단계 크리티컬 공격 당했을때

		EF_DOGMA_L3_FOOT_QUAKE			= 1058,				//도그마베인 - 3단계 발구르기
		EF_DOGMA_L3_FOOT_QUAKEED		= 1059,				//도그마베인 - 3단계 발구르기 당했을때

		EF_DOGMA_L3_WRATH_ONECUT2		= 1060,				//도그마베인 - 3단계 분노의 일격2
		EF_DOGMA_L3_WRATH_ONECUT2ED		= 1061,				//도그마베인 - 3단계 분노의 일격2 당했을때

		EF_DOGMA_L4_CIRCLE_SWORD		= 1062,				//도그마베인 - 4단계 대원참
		EF_DOGMA_L4_CIRCLE_SWORDED		= 1063,				//도그마베인 - 4단계 대원참 당했을때
		
		EF_BEFORE_ATTACKER_MARK			= 1064,				//중국 - 선제공격자 표시 이펙트
		
		EF_FIREHEARTFLOWER				= 1065,				//불꽃 하트모양	
		EF_FIREENGLOVEFLOWER			= 1066,				//영어 - 사랑해 불꽃
		EF_FIRENATLOVEFLOWER			= 1067,				//고유언어 - 사랑해 불꽃
		
		EF_RUGAL_HOWLLING_1				= 1068,				//루갈- 하울링 포효 이펙트 
		EF_RUGAL_HOWLLING_1_ED			= 1069,				//루갈- 하울링 당하는 이펙트 
		EF_RUGAL_HOWLLING_1_STAT		= 1070,				//루갈- 하울링 공포상태 지속이펙트
		EF_RUGAL_CURSE_1				= 1071,				//루갈- 저주이펙트
		EF_RUGAL_CURSE_1_ED				= 1072,				//루갈- 저주 당하는 이펙트
		EF_RUGAL_CURSE_1_STAT			= 1073,				//루갈- 저주 지속이펙트
		EF_RUGAL_ILLUSIONTREE_1			= 1074,				//루갈- 환목 이펙트	
		EF_RUGAL_ILLUSIONTREE_1_ED		= 1075,				//루갈- 환목 당하는이펙트
		EF_RUGAL_ONECUTOFRUIN			= 1076,				//루갈- 파멸의 일격 이펙트
		EF_RUGAL_ONECUTOFRUINED			= 1077,				//루갈- 파멸의 일격 이펙트 당했을때
		EF_RUGAL_NAIL_OFDECAY			= 1078,				//루갈- 부패의 손톱 이펙트
		EF_RUGAL_NAIL_OFDECAYED			= 1079,				//루갈- 부패의 손톱 당했을때
		EF_RUGAL_RECALL_SOLTAR			= 1080,				//루갈- 솔타르의 소환	
		EF_RUGAL_RECALL_SOLTARED		= 1081,				//루갈- 솔타르의 소환에위해 소환되는 NPC에 잠시나옴
		EF_RUGAL_CLO_CYCLON				= 1082,				//루갈- 클로 사이클론	
		EF_RUGAL_CLO_CYCLONED			= 1083,				//루갈- 클로 사이클론 당했을때
		EF_RUGAL_DRIL_TEMPEST			= 1084,				//루갈- 드릴 템페스트 
		EF_RUGAL_DRIL_TEMPESTED			= 1085,				//루갈- 드릴 템페스트 당했을때 
		EF_RUGAL_DRIL_HURRICANE			= 1086,				//루갈- 드릴 허리케인	
		EF_RUGAL_DRIL_HURRICANEED		= 1087,				//루갈- 드릴 허리케인 당했을때

		EF_SPECIAL_ITEM_EFFECT_PROMINAS		= 1088,				//클래스 지존아이템 - 연결 이펙트 - 프로미나스
		EF_SPECIAL_ITEM_EFFECT_PSYCHE		= 1089,				//클래스 지존아이템 - 연결 이펙트 - 싸이키
		EF_SPECIAL_ITEM_EFFECT_MERCENARY	= 1090,				//클래스 지존아이템 - 연결 이펙트 - 머시너리
		EF_SPECIAL_ITEM_EFFECT_KNIGHT		= 1091,				//클래스 지존아이템 - 연결 이펙트 - 나이트 
		EF_SPECIAL_ITEM_EFFECT_SLAYER		= 1092,				//클래스 지존아이템 - 연결 이펙트 - 슬레이어
		EF_SPECIAL_ITEM_EFFECT_SNIPER		= 1093,				//클래스 지존아이템 - 연결 이펙트 - 스나이퍼
		EF_SPECIAL_ITEM_EFFECT_PRIEST		= 1094,				//클래스 지존아이템 - 연결 이펙트 - 프리스트
		EF_SPECIAL_ITEM_EFFECT_HOLY			= 1095,				//클래스 지존아이템 - 연결 이펙트 - 홀리 어벤져
		
		EF_BARAGOS_BASIC_ATTACK				= 1096,				///-- 바라고스 - 기본공격 이펙트
		EF_BARAGOS_BASIC_ATTACKED			= 1097,				///-- 바라고스 - 기본공격 이펙트 맞았을때
		EF_BARAGOS_CRI_ATTACK				= 1098,				///-- 바라고스 - 크리티컬 어택
		EF_BARAGOS_CRI_ATTACKED				= 1099,				///-- 바라고스 - 크리티컬 어택 맞았을때
		EF_BARAGOS_DRAGON_BRESS				= 1100,				///-- 바라고스 - 드래곤 브레스
		EF_BARAGOS_DRAGON_BRESSED			= 1101,				///-- 바라고스 - 드래곤 브레스 맞았을때
		EF_BARAGOS_HOWL_OF_DEVIL			= 1102,				///-- 바라고스 - 악룡의 포효
		EF_BARAGOS_HOWL_OF_DEVILED			= 1103,				///-- 바라고스 - 악룡의 포효 당했을때		
		
		EF_DARK_BOMB_BALL				=   1104 ,			// 어둠의 폭발-날라가는 공
		EF_DARK_BOMB_ED					=   1105 ,			// 어둠의 폭발-당했을때
		EF_DARK_BOMB_LINK				=	1106 ,			// 어둠의 폭발-영창 

		EF_MASTER_DOGMA_APPEAR_EFFECT	= 1107,				// 도그마 4단계 외형 이펙트

		EF_BARAGOS_THUNDERBREAK				= 1108,				///-- 바라고스 - 선더 브레이크
		EF_BARAGOS_THUNDERBREAKED			= 1109,				///-- 바라고스 - 선더 브레이크 당했을때
		EF_BARAGOS_BERSERK					= 1110,				///-- 바라고스 - 광폭화
		EF_JANAD_BASIC_ATTACK				= 1111,				///-- 쟈나드 - 기본공격 이펙트
		EF_JANAD_BASIC_ATTACKED				= 1112,				///-- 쟈나드 - 기본공격 이펙트 맞았을때
		EF_JANAD_CRI_ATTACK					= 1113,				///-- 쟈나드 - 크리티컬 어택
		EF_JANAD_CRI_ATTACKED				= 1114,				///-- 쟈나드 - 크리티컬 어택 당했을때
		EF_JANAD_DASHTRIPLE_ATTACK			= 1115,				///-- 쟈나드 - 돌진 3단 공격
		EF_JANAD_DASHTRIPLE_ATTACKED		= 1116,				///-- 쟈나드 - 돌진 3단 공격 당했을때
		EF_JANAD_CALLDEVILSOUL				= 1117,				///-- 쟈나드 - 마령소환
		EF_JANAD_CALLDEVILSOULED			= 1118,				///-- 쟈나드 - 소환되는 마령관련 이펙트
		EF_JANAD_DARKSWORDSTORM				= 1119,				///-- 쟈나드 - 암흑 검풍
		EF_JANAD_DARKSWORDSTORMED			= 1120,				///-- 쟈나드 - 암흑 검풍 당했을때
		EF_JANAD_DISPEL						= 1121,				///-- 쟈나드 - 디스펠
		EF_JANAD_DISPELED					= 1122,				///-- 쟈나드 - 디스펠 당했을때
		EF_JANAD_MAGMA_BUST					= 1123,				///-- 쟈나드 - 마그마 버스트
		EF_JANAD_MAGMA_BUSTED				= 1124,				///-- 쟈나드 - 마그마 버스트 당했을때
		EF_JANAD_SWORD_FLASH_OF_DEVIL		= 1125,				///-- 쟈나드 - 마황의 검진
		EF_JANAD_SWORD_FLASH_OF_DEVILED1126	= 1126,				///-- 쟈나드 - 마황의 검진(불기둥)
		EF_JANAD_SWORD_FLASH_OF_DEVILED1127	= 1127,				///-- 쟈나드 - 마황의 검진 당했을때
		EF_BARAGOS_THUNDERBREAK1128			= 1128,				///-- 바라고스 - 선더 브레이크(굵은 번개와 바닥)
		EF_BARAGOS_THUNDERBREAK1129			= 1129,				///-- 바라고스 - 선더 브레이크(랜덤 번개)
		EF_BARAGOS_BERSERK1130				= 1130,				///-- 바라고스 - 광폭화(바닥 먼지)
		EF_BARAGOS_HOWL_OF_DEVIL1131		= 1131,				///-- 바라고스 - 악룡의 포효(한쪽발 먼지)
		EF_BARAGOS_DRAGON_BRESS1132			= 1132,				///-- 바라고스 - 드래곤 브레스(검은연기)
		EF_BARAGOS_DRAGON_BRESS1133			= 1133,				///-- 바라고스 - 드래곤 브레스(불-여러곳에 뿌려주세요)
		EF_BARAGOS_DRAGON_BRESS1134			= 1134,				///-- 바라고스 - 드래곤 브레스(바닥)
		EF_JANAD_CALLDEVILSOUL1135			= 1135,				///-- 쟈나드 - 마령소환(바닥)
		EF_JANAD_DISPEL1136					= 1136,				///-- 쟈나드 - 디스펠
		
		EF_UROBOROS_POISON					= 1137,				///-- 우로보스-포이즌 브레스
		EF_UROBOROS_POISON_ED				= 1138,				///-- 우로보스-포이즌 당했을때
		EF_UROBOROS_BALKAN					= 1139,				///-- 우로보스-프레임발칸
		EF_UROBOROS_BALKAN_ED				= 1140,				///-- 우로보스-프레임발칸 당했을때
		EF_UROBOROS_DRAG_HOWLLING			= 1141,				///-- 우로보스-드라그 하울링 
		EF_UROBOROS_DRAG_HOWLLING_ED		= 1142,				///-- 우로보스-드라그 하울링 당했을때
		EF_UROBOROS_RUN						= 1143,				///-- 우로보스-돌진
		EF_UROBOROS_RUN_ED					= 1144,				///-- 우로보스-돌진당했을때 

		EF_JANAD_MAGMA_BUST1145				= 1145,				///-- 쟈나드 - 마그마 버스트(앞쪽 기모음)
		EF_JANAD_DARKSWORDSTORM1146			= 1146,				///-- 쟈나드 - 암흑 검풍(암흙 볼)
		EF_BARAGOS_CRI_ATTACK1147			= 1147,				///-- 바라고스 - 크리티컬 어택(바닥먼지)
		EF_JANAD_DASHTRIPLE_ATTACK1148		= 1148,				///-- 쟈나드 - 돌진 3단 공격

		EF_UROBOROS_DUST					= 1149,			//	우로보로스-바닥먼지(모든 우로보로스에 적용)
		EF_UROBOROS_BALKAN_MOUTH			= 1150, 			///--우로보로스-프레임발칸(입에 붙음)
		EF_UROBOROS_RUN_MOUTH				= 1151,				///--	우로보로스-돌진(입에 붙음)
		EF_UROBOROS_BASIC_ATTACK			= 1152,				///--	우로보로스- 기본공격 이펙트
		EF_UROBOROS_BASIC_ATTACKED			= 1153,				///--	우로보로스 - 기본공격 이펙트 맞았을때
		EF_UROBOROS_CRI_ATTACK				= 1154,				///--	우로보로스- 크리티컬 어택
		EF_UROBOROS_CRI_ATTACKED			= 1155,				///--	우로보로스- 크리티컬 어택 맞았을때
//		EF_RUGAL_DRIL_HURRICANE				= 1156,				///--	루갈 - 드릴 허리케인(드릴잔상)
		EF_RUGAL_BASIC_ATTACK				= 1157,				///--	루갈- 기본공격 이펙트
		EF_RUGAL_BASIC_ATTACKED				= 1158,				///--	루갈 - 기본공격 이펙트 맞았을때
		EF_RUGAL_CRI_ATTACK					= 1159,				///--	루갈- 크리티컬 어택
		EF_RUGAL_CRI_ATTACKED				= 1160,				///--	루갈- 크리티컬 어택 맞았을때
		EF_RUGALSOLDART_BASIC_ATTACK		= 1161,				///--	루갈 솔다트- 기본공격 이펙트
		EF_RUGALSOLDART_BASIC_ATTACKED		= 1162,				///--	루갈 솔다트- 기본공격 이펙트 맞았을때
		EF_RUGALSOLDART_CRI_ATTACK			= 1163,				///--	루갈 솔다트- 크리티컬 어택
		EF_RUGALSOLDART_CRI_ATTACKED		= 1164,				///--	루갈 솔다트- 크리티컬 어택 맞았을때
		EF_RUGALTEMPEST_BASIC_ATTACK		= 1165,				///--	루갈 템페스트- 기본공격 이펙트
		EF_RUGALTEMPEST_BASIC_ATTACKED		= 1166,				///--	루갈 템페스트- 기본공격 이펙트 맞았을때
		EF_RUGALTEMPEST_CRI_ATTACK_RIGHT	= 1167,				///--	루갈 템페스트- 크리티컬 어택(왼쪽드릴)
		EF_RUGALTEMPEST_CRI_ATTACK_LEFT		= 1168,				///--	루갈 템페스트- 크리티컬 어택(오른쪽드릴)
		EF_RUGALTEMPEST_CRI_ATTACK_END		= 1169,				///--	루갈 템페스트- 크리티컬 어택(모아졌을때가운데)
		EF_RUGALTEMPEST_CRI_ATTACKED		= 1170,				///--	루갈 템페스트- 크리티컬 어택 맞았을때

		EF_BASE_ITEM_EFFECT_PROMINAS		= 1172,				//클래스 지존아이템 - 연결 이펙트 - 프로미나스
		EF_BASE_ITEM_EFFECT_PSYCHE		= 1173,				//클래스 지존아이템 - 연결 이펙트 - 싸이키
		EF_BASE_ITEM_EFFECT_MERCENARY	= 1174,				//클래스 지존아이템 - 연결 이펙트 - 머시너리
		EF_BASE_ITEM_EFFECT_KNIGHT		= 1175,				//클래스 지존아이템 - 연결 이펙트 - 나이트 
		EF_BASE_ITEM_EFFECT_SLAYER		= 1176,				//클래스 지존아이템 - 연결 이펙트 - 슬레이어
		EF_BASE_ITEM_EFFECT_SNIPER		= 1177,				//클래스 지존아이템 - 연결 이펙트 - 스나이퍼
		EF_BASE_ITEM_EFFECT_PRIEST		= 1178,				//클래스 지존아이템 - 연결 이펙트 - 프리스트
		EF_BASE_ITEM_EFFECT_HOLY			= 1179,				//클래스 지존아이템 - 연결 이펙트 - 홀리 어벤져
		


		EF_JANAD_SWORD_FLASH_OF_DEVILED1171 = 1171,				///-- 쟈나드 - 마황의 검진(불기둥 쏟을때 바닥_여러번)		

		EF_DONG_TEST_0 					= 99999 ,			//이펙트 테스트.. 
		//
		EF_MAXCOUNT				        = 100000			// 
		//....................................................................................
};

typedef enum PARTICLE_ID
{
	PT_STICK_STAND_ATTACK0        = 836  , // 지팡이 기본공격시 볼
	PT_BOOK_STAND_ATTACK0		  = 824	 , // 마법 기본 공격시 볼  
	PT_BOOK_STAND_ATTACK_TAIL	  = 825  , // 파이어볼 꼬리
	PT_WALK_DUST				  = 0	 , // 걷기 먼지
	PT_FIREBALL_TAIL			  = 911  , // 파이어볼 꼬리~
	PT_FIREBALL					  = 900	 ,
	PT_LIGHTNING_HAND			  = 906  , // 라이트닝시 손에 파티클
	PT_ROCKPRESS_CLOUD			  = 930  , // 락프레스 구름 꾸물꾸물
	PT_SWORD_GATHER_CUT			  = 117 	, // 모이는 파티클
	PT_SWORD_BALL_GATHER_CUT	  = 118  , // 모인거
	PT_ICESPIRE_PAR				  = 935  , // 아이스 스피어 파파팍
	PT_BUBBLE_TAIL				  = 826  , // 버블 크래쉬 꼬리
	PT_REFRESH_SWORD_LINK		  = 920  , // 쾌검 꼬리
	PT_STRONG_SWORD_LINK		  = 922  , // 강검 ( 지속 스킬 )
	PT_BOOK_STAND_CRITICAL_ATTACK = 205  , // 마법 기본 책 공격 크리티컬 볼
	PT_REFRESH_BOW_TAIL			  = 276  , // 치유의화살 꼬랑지
	PT_FOOT_BOW_TAIL			  = 277  , // 발등쏘기 화살 꼬랑지
	PT_FOOT_SAND				  = 288  , // 모래 
	PT_FOOT_SNOW				  = 289  , // 눈 발자국
	PT_PRIEST_BALL				  =	309	 , // 프리스트 기본공격 볼
	PT_PRIEST_BALL_TAIL		  	  =	308	 , // 프리스트 기본공격 볼 꼬랑지
	// 3차 NPC 스킬 파티클
	PT_NPC_FIRE_BALL			  = 309	 , // NPC 화이어볼 	
	PT_NPC_BUBBLE_TAIL			  = 316  , // NPC 버블 꼬리
	PT_NPC_MOUTH_FIRE_BALL		  = 320  , // NPC 입에서 불쏘기 불
	PT_NPC_MOUTH_FIRE_BALL_TAIL   = 321  , // NPC 입에서 불쏘기 불 꼬리
	PT_NPC_MOUTH_FIRE_BALL1		  = 322  , // NPC 입에서 불쏘기 불 1
	PT_NPC_MOUTH_FIRE_BALL_TAIL1  = 323  , // NPC 입에서 불쏘기 불 꼬리 1`
	PT_NPC_MOUTH_GAS			  = 324  , // NPC 입에서 가스 덩어리
	PT_NPC_MOUTH_GAS_TAIL		  = 325  , // NPC 입에서 가스 덩어리 꼬리
	PT_GAGE_BALL				  = 328	 , // 게이지 전송
	PT_GAGE_BALL_TAIL			  = 329	 , // 게이지 전송
	PT_NPC_STICK_BALL			  = 220	 , // NPC 지팡이 볼	

	PT_COMBO_ADD_BOW_TAIL		  = 21902 , // 각성의 화살 꼬랑지
	PT_WHISPER_BOW_TAIL			  = 21904 , // 침묵의 화살 꼬랑지
	PT_CLEAR_BOW_TAIL			  = 21903 , // 정화의 화살 꼬랑지
	PT_CANCEL_BOW_TAIL			  = 21905 , // 각성의 화살 꼬랑지
	
	PT_DEFENSE_PET				  =	24117 , // 보호막을 에너지 볼
	PT_ICESPEAR_TAIL			  = 24178 , // 아이스스피어 꼬리부분
	PT_ROUND_FIRE1				  = 24189 , // 라운드 파이어 불꽃1	
	PT_ROUND_FIRE2				  = 24190 , // 라운드 파이어 불꽃2
	PT_VIOLET_TAIL				  =	24207 , // 보라색 꼬리
	PT_CASTSTONE_TAIL			  = 24212 , // 캐스트 스톤 꼬리부분
	PT_RANDOMARROW_TAIL			  = 24237 , // 난사 꼬리부분
	PT_PARALYSIS_BOW_TAIL		  = 24332 , // 마비의 화살 꼬랑지
	PT_POISON_BOW_TAIL			  = 24333 ,	// 독화살 꼬랑지	

	PT_GGOLEM_SKILLHAND_TAIL1	  = 24424,  // 거신병 손 파티클

	PT_MAXCOUNT					  = 100000
};

typedef enum BILLBOARD_ID
{
	BB_STICK_STAND_ATTACK0		 = 835	, // 지팡이 기본 공격시 지팡이 끝에 나오는 효과
	BB_WALK_WATER_WAVE			 = 2	, // 걷기 물파장
	BB_LIGHTNING_HAND			 = 912  , // 라이트닝시 손에 빌보드
	BB_ROCKPRESS_DAMAGE			 = 922  , // 돌 떨어질때 데미지 히트
	BB_BOOK_CRITICAL_LEFT_LINK	 = 222  , // 책공격 왼쪽 손에 달릴꺼
	BB_BOOK_CRITICAL_RIGHT_LINK	 = 221  , // 책공격 오른쪽 손에 달릴꺼
	BB_SNOW0					 = 324  , // 눈	
	BB_SNOW1					 = 325  , // 눈	
	BB_SNOW2					 = 326  , // 눈	
	BB_SNOW3					 = 327  , // 눈	
	BB_SNOW4					 = 328  , // 눈	
	BB_SNOW5					 = 329  , // 눈	
	BB_SNOW6					 = 330  , // 눈	
	BB_SNOW7					 = 331  , // 눈	
	BB_SNOW8					 = 332  , // 눈	
	BB_SNOW9					 = 333  , // 눈	
	BB_SNOW10					 = 334  , // 눈	
	BB_SNOW11					 = 335  , // 눈	
	BB_NPC_BUBBLE				 = 344  , // NPC 버블	
	BB_CANNON_BALL				 = 24435 , //포탄
	BB_GT_L2_BALL				 = 24491 , //가드타워 레벨2 포탄
	BB_GT_L3_BEAM				 = 24497 , //가드타워 레벨3 빔
	BB_MAXCOUNT					 = 100000
};

#endif