#ifndef __CCOLLISION_H
#define __CCOLLISION_H

#include "d3d9.h"
#include "d3dx9math.h"


class CCollision
{
public:
	 
	 CCollision();
	~CCollision();

public:

	//.....................................................................................................................
	// 삼각형 반직선 충돌 테스트
	//.....................................................................................................................
	BOOL	ISFaceCollision(D3DXVECTOR3 &vFace0,D3DXVECTOR3 &vFace1,D3DXVECTOR3 &vFace2,
							D3DXVECTOR3 &vStartLine,D3DXVECTOR3 &vEndLine,D3DXVECTOR3 vCollision);
	
	//.....................................................................................................................
	// 점이 삼각형 내에 있남?
	//.....................................................................................................................
	BOOL ISInsideFace(D3DXVECTOR3 &v0,D3DXVECTOR3 &v1,D3DXVECTOR3 &v2,D3DXVECTOR3 &vPos);

	//.....................................................................................................................
	// 반직선이 평면에 걸치남? 평면의 공통으로 아래 또는 위쪽에 있을때는 안걸침
	//.....................................................................................................................
	BOOL CCollision::ISIntersectPlane(D3DXVECTOR3 &v0,D3DXVECTOR3 &v1,D3DXPLANE &Plane);

};

#endif